{"version":"1","records":[{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter"},"type":"lvl1","url":"/governance","position":0},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter"},"content":"Note\n\nPrior to December 2022, Project Jupyter had a governance model based on a BDFL and a Steering Council, as described in this document.\n\nThe official version of this document, along with a list of\nindividuals and institutions in the roles defined in the governance\nsection below, is contained in The Project Governance Repository at:\n\nhttps://​github​.com​/jupyter​/governance","type":"content","url":"/governance","position":1},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl2":"The Project"},"type":"lvl2","url":"/governance#the-project","position":2},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl2":"The Project"},"content":"The Jupyter/IPython Project (The Project) is an open source software project\naffiliated with the 501c3 NumFOCUS Foundation. The goal of The Project is to\ndevelop open source software and deploy open and public websites and services\nfor reproducible, exploratory and interactive computing. The Software developed\nby The Project is released under the BSD (or similar) open source license,\ndeveloped openly and hosted in public GitHub repositories under the\n\n\nIPython GitHub organization and the\n\n\nJupyter GitHub organization. Examples of\nProject Software include the IPython Notebook, the IPython Terminal,\nIPython.parallel, the Jupyter Hub, etc. The Services run by the\nProject consist of public websites and web-services that are hosted\nunder the \n\njupyter.org or \n\nipython.org domains. The Services Examples of\nProject Services include the Jupyter and IPython websites\n(\n\nhttps://jupyter.org and\n\n\nhttps://ipython.org), nbviewer\n(\n\nhttps://​nbviewer​.ipython​.org) and the\nJupyter coLaboratory\n(\n\nhttps://​colaboratory​.jupyter​.org).\n\nThe Project is developed by a team of distributed developers, called\nContributors. Contributors are individuals who have contributed code,\ndocumentation, designs or other work to one or more Project repositories.\nAnyone can be a Contributor. Contributors can be affiliated with any legal\nentity or none. Contributors participate in the project by submitting,\nreviewing and discussing GitHub Pull Requests and Issues and participating in\nopen and public Project discussions on GitHub, Google+, Hackpad, Gitter chat\nrooms and mailing lists. The foundation of Project participation is openness\nand transparency.\n\nHere is a list of the current Contributors to the main IPython repository:\n\nhttps://​github​.com​/ipython​/ipython​/graphs​/contributors\n\nThere are also many other Contributors listed in the logs of other repositories of\nthe Jupyter and IPython projects.\n\nThe Project Community consists of all Contributors and Users of the Project.\nContributors work on behalf of and are responsible to the larger Project\nCommunity and we strive to keep the barrier between Contributors and Users as\nlow as possible.\n\nThe Project is formally affiliated with the 501c3 NumFOCUS Foundation\n(\n\nhttps://​numfocus​.org), which serves as its fiscal\nsponsor, may hold project trademarks and other intellectual property, helps\nmanage project donations and acts as a parent legal entity. NumFOCUS is the\nonly legal entity that has a formal relationship with the project (see\nInstitutional Partners section below).","type":"content","url":"/governance#the-project","position":3},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl2":"Governance"},"type":"lvl2","url":"/governance#governance","position":4},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl2":"Governance"},"content":"This section describes the governance and leadership model of The Project.\n\nThe foundations of Project governance are:\n\nOpenness & Transparency\n\nActive Contribution\n\nInstitutional Neutrality\n\nTraditionally, Project leadership was provided by a BDFL (Fernando Perez) and\nsubset of Contributors, called Core Developers, whose active and consistent\ncontributions have been recognized by their receiving “commit rights” to the\nProject GitHub repositories. In general all Project decisions are made through\nconsensus among the Core Developers with input from the Community. The BDFL\ncan, but rarely chooses to, override the Core Developers and make a final\ndecision on a matter.\n\nWhile this approach has served us well, as the Project grows and faces more\nlegal and financial decisions and interacts with other institutions, we see a\nneed for a more formal governance model. Moving forward The Project leadership\nwill consist of a BDFL and Steering Council. We view this governance model as\nthe formalization of what we are already doing, rather than a change in\ndirection.","type":"content","url":"/governance#governance","position":5},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl3":"BDFL","lvl2":"Governance"},"type":"lvl3","url":"/governance#bdfl","position":6},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl3":"BDFL","lvl2":"Governance"},"content":"The Project will have a BDFL (Benevolent Dictator for Life), who is currently\nFernando Perez. As Dictator, the BDFL has the authority to make all final\ndecisions for The Project. As Benevolent, the BDFL, in practice chooses to\ndefer that authority to the consensus of the community discussion channels and\nthe Steering Council (see below). It is expected, and in the past has been the\ncase, that the BDFL will only rarely assert his/her final authority. Because\nrarely used, we refer to BDFL’s final authority as a “special” or “overriding”\nvote. When it does occur, the BDFL override typically happens in situations\nwhere there is a deadlock in the Steering Council or if the Steering Council\nasks the BDFL to make a decision on a specific matter. To ensure the\nbenevolence of the BDFL, The Project encourages others to fork the project if\nthey disagree with the overall direction the BDFL is taking. The BDFL is chair\nof the Steering Council (see below) and may delegate his/her authority on a\nparticular decision or set of decisions to any other Council member at his/her\ndiscretion.\n\nThe BDFL can appoint his/her successor, but it is expected that the Steering\nCouncil would be consulted on this decision. If the BDFL is unable to appoint a\nsuccessor, the Steering Council will make a suggestion or suggestions to the\nMain NumFOCUS Board. While the Steering Council and Main NumFOCUS Board will\nwork together closely on the BDFL selection process, the Main NUMFOCUS Board\nwill make the final decision.","type":"content","url":"/governance#bdfl","position":7},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl3":"Steering Council","lvl2":"Governance"},"type":"lvl3","url":"/governance#steering-council","position":8},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl3":"Steering Council","lvl2":"Governance"},"content":"The Project will have a Steering Council that consists of Project Contributors\nwho have produced contributions that are substantial in quality and quantity,\nand sustained over at least one year. The overall role of the Council is to\nensure, through working with the BDFL and taking input from the Community, the\nlong-term well-being of the project, both technically and as a community.\n\nDuring the everyday project activities, council members participate in all\ndiscussions, code review and other project activities as peers with all other\nContributors and the Community. In these everyday activities, Council Members\ndo not have any special power or privilege through their membership on the\nCouncil. However, it is expected that because of the quality and quantity of\ntheir contributions and their expert knowledge of the Project Software and\nServices that Council Members will provide useful guidance, both technical and\nin terms of project direction, to potentially less experienced contributors.\n\nThe Steering Council and its Members play a special role in certain situations.\nIn particular, the Council may:\n\nMake decisions about the overall scope, vision and direction of the\nproject.\n\nMake decisions about strategic collaborations with other organizations or\nindividuals.\n\nMake decisions about specific technical issues, features, bugs and pull\nrequests. They are the primary mechanism of guiding the code review process\nand merging pull requests.\n\nMake decisions about the Services that are run by The Project and manage\nthose Services for the benefit of the Project and Community.\n\nMake decisions when regular community discussion doesn’t produce consensus\non an issue in a reasonable time frame.","type":"content","url":"/governance#steering-council","position":9},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl4":"Council membership","lvl3":"Steering Council","lvl2":"Governance"},"type":"lvl4","url":"/governance#council-membership","position":10},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl4":"Council membership","lvl3":"Steering Council","lvl2":"Governance"},"content":"To become eligible for being a Steering Council Member an individual must be a\nProject Contributor who has produced contributions that are substantial in\nquality and quantity, and sustained over at least one year. Potential Council\nMembers are nominated by existing Council members and voted upon by the\nexisting Council. Based on a successful vote, the newly elected Member is\ninvited to serve in that capacity. The Council will be initially formed from\nthe set of existing Core Developers who, as of late 2014, have been\nsignificantly active over the last year.\n\nWhen considering potential Members, the Council will look at candidates with a\ncomprehensive view of their contributions. This will include but is not limited\nto code, code review, infrastructure work, mailing list and chat participation,\ncommunity help/building, education and outreach, design work, etc. We are\ndeliberately not setting arbitrary quantitative metrics (like “100 commits in\nthis repo”) to avoid encouraging behavior that plays to the metrics rather than\nthe project’s overall well-being. We want to encourage a diverse array of\nbackgrounds, viewpoints and talents in our team, which is why we explicitly do\nnot define code as the sole metric on which council membership will be\nevaluated.\n\nIf a Council member becomes inactive in the project for a period of one year,\nthey will be considered for removal from the Council. Before removal, inactive\nMember will be approached by the BDFL to see if they plan on returning to\nactive participation. If not they will be removed immediately upon a Council\nvote. If they plan on returning to active participation soon, they will be\ngiven a grace period of one year. If they don’t return to active participation\nwithin that time period they will be removed by vote of the Council without\nfurther grace period. All former Council members can be considered for\nmembership again at any time in the future, like any other Project Contributor.\nRetired Council members will be listed on the project website, acknowledging\nthe period during which they were active in the Council.\n\nThe Council reserves the right to eject current Members, other than the BDFL,\nif they are deemed to be actively harmful to the project’s well-being, and\nattempts at communication and conflict resolution have failed.","type":"content","url":"/governance#council-membership","position":11},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl4":"Conflict of interest","lvl3":"Steering Council","lvl2":"Governance"},"type":"lvl4","url":"/governance#conflict-of-interest","position":12},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl4":"Conflict of interest","lvl3":"Steering Council","lvl2":"Governance"},"content":"It is expected that the BDFL and Council Members will be employed at a wide\nrange of companies, universities and non-profit organizations. Because of this,\nit is possible that Members will have conflict of interests. Such conflict of\ninterests include, but are not limited to:\n\nFinancial interests, such as investments, employment, or contracting work,\noutside of The Project that may influence their work on The Project.\n\nAccess to proprietary information of their employer that could potentially\nleak into their work with the Project.\n\nAn issue where the person privately gains an advantage from The Project\nresources, but The Project has no gain or suffers a disadvantage.\n\nAll members of the Council, BDFL included, shall disclose to the rest of the\nCouncil any conflict of interest they may have. Members with a conflict of\ninterest in a particular issue may participate in Council discussions on that\nissue, but must recuse themselves from voting on the issue. If the BDFL has\nrecused his/herself for a particular decision, they will appoint a substitute\nBDFL for that decision.","type":"content","url":"/governance#conflict-of-interest","position":13},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl4":"Private communications of the Council","lvl3":"Steering Council","lvl2":"Governance"},"type":"lvl4","url":"/governance#private-communications-of-the-council","position":14},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl4":"Private communications of the Council","lvl3":"Steering Council","lvl2":"Governance"},"content":"Unless specifically required, all Council discussions and activities will be\npublic and done in collaboration and discussion with the Project Contributors\nand Community. The Council will have a private mailing list that will be used\nsparingly and only when a specific matter requires privacy. When private\ncommunications and decisions are needed, the Council will do its best to\nsummarize those to the Community after eliding personal/private/sensitive\ninformation that should not be posted to the public internet.","type":"content","url":"/governance#private-communications-of-the-council","position":15},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl4":"Subcommittees","lvl3":"Steering Council","lvl2":"Governance"},"type":"lvl4","url":"/governance#subcommittees","position":16},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl4":"Subcommittees","lvl3":"Steering Council","lvl2":"Governance"},"content":"The Council can create subcommittees that provide leadership and guidance for\nspecific aspects of the project. Like the Council as a whole, subcommittees\nshould conduct their business in an open and public manner unless privacy is\nspecifically called for. Private subcommittee communications should happen on\nthe main private mailing list of the Council unless specifically called for.\n\nQuestion: if the BDFL is not on a subcommittee, do they still have override\nauthority?\n\nSuggestion: they do, but they should appoint a delegate who plays that role\nmost of the time, and explicit BDFL intervention is sought only if the\ncommittee disagrees with that delegate’s decision and no resolution is possible\nwithin the team. This is different from a BDFL delegate for a specific decision\n(or a recusal situation), where the BDFL is literally giving up his/her\nauthority to someone else in full. It’s more like what Linus Torvalds uses with his\n“lieutenants” model.","type":"content","url":"/governance#subcommittees","position":17},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl4":"NumFOCUS Subcommittee","lvl3":"Steering Council","lvl2":"Governance"},"type":"lvl4","url":"/governance#numfocus-subcommittee","position":18},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl4":"NumFOCUS Subcommittee","lvl3":"Steering Council","lvl2":"Governance"},"content":"The Council will maintain one narrowly focused subcommittee to manage its\ninteractions with NumFOCUS.\n\nThe NumFOCUS Subcommittee is comprised of 5 persons who manage project\nfunding that comes through NumFOCUS. It is expected that these funds will\nbe spent in a manner that is consistent with the non-profit mission of\nNumFOCUS and the direction of the Project as determined by the full\nCouncil.\n\nThis Subcommittee shall NOT make decisions about the direction, scope or\ntechnical direction of the Project.\n\nThis Subcommittee will have 5 members, 4 of whom will be current Council\nMembers and 1 of whom will be external to the Steering Council. No more\nthan 2 Subcommitee Members can report to one person through employment or\ncontracting work (including the reportee, i.e. the reportee + 1 is the\nmax). This avoids effective majorities resting on one person.","type":"content","url":"/governance#numfocus-subcommittee","position":19},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl2":"Institutional Partners and Funding"},"type":"lvl2","url":"/governance#institutional-partners-and-funding","position":20},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl2":"Institutional Partners and Funding"},"content":"The BDFL and Steering Council are the primary leadership for the project. No\noutside institution, individual or legal entity has the ability to own,\ncontrol, usurp or influence the project other than by participating in the\nProject as Contributors and Council Members. However, because institutions are\nthe primary funding mechanism for the project, it is important to formally\nacknowledge institutional participation in the project. These are Institutional\nPartners.\n\nAn Institutional Contributor is any individual Project Contributor who\ncontributes to the project as part of their official duties at an Institutional\nPartner. Likewise, an Institutional Council Member is any Project Steering\nCouncil Member who contributes to the project as part of their official duties\nat an Institutional Partner.\n\nWith these definitions, an Institutional Partner is any recognized legal entity\nin the United States or elsewhere that employs at least one Institutional\nContributor or Institutional Council Member. Institutional Partners can be\nfor-profit or non-profit entities.\n\nInstitutions become eligible to become an Institutional Partner by\nemploying individuals who actively contribute to The Project as part\nof their official duties. To state this another way, the only way for\nan Institutional Partner to influence the project is by actively\ncontributing to the open development of the project, on equal terms\nwith any other member of the community of Contributors and Council\nMembers. Merely using Jupyter/IPython Software or Services in an\ninstitutional context does not allow an entity to become an\nInstitutional Partner. Financial gifts do not enable an entity to\nbecome an Institutional Partner. Once an institution becomes eligible\nfor Institutional Partnership, the Steering Council must nominate and\napprove the Partnership.\n\nIf an existing Institutional Partner no longer has a contributing employee,\nthey will be given a one-year grace period for other employees to begin\ncontributing.\n\nAn Institutional Partner is free to pursue funding for their work on The\nProject through any legal means. This could involve a non-profit organization\nraising money from private foundations and donors or a for-profit company\nbuilding proprietary products and services that leverage Project Software and\nServices. Funding acquired by Institutional Partners to work on The Project is\ncalled Institutional Funding. However, no funding obtained by an Institutional\nPartner can override The Project BDFL and Steering Council. If a Partner has\nfunding to do Jupyter/IPython work and the Council decides to not pursue that\nwork as a project, the Partner is free to pursue it on their own. However in\nthis situation, that part of the Partner’s work will not be under the\nJupyter/IPython umbrella and cannot use the Project trademarks in a way that\nsuggests a formal relationship.\n\nTo acknowledge institutional contributions, there are two level of Institutional\nPartners, with associated benefits:\n\nTier 1 = an institution with at least one Institutional Council Member\n\nAcknowledged on the Jupyter/IPython websites, in talks and T-shirts.\n\nAbility to acknowledge their own funding sources on the Jupyter/IPython\nwebsites, in talks and T-shirts.\n\nUnlimited participation in the annual Institutional Partners Workshop, held\nduring the (planned) annual Jupyter Project Retreat. This allows the\nInstitutional Partner to invite as many of their own employees and funding\nsources and collaborators as they want, even if they are not project\nContributors or Council Members.\n\nAbility to influence the project through the participation of their Council\nMember.\n\nCouncil Members are invited to the bi-annual Jupyter/IPython Developer Meeting.\n\nTier 2 = an institution with at least one Institutional Contributor\n\nSame benefits as Tier 1 level Partners, but:\n\nOnly Institutional Contributors are invited to the Institutional Partners\nWorkshop and bi-annual Jupyter/IPython Developer Meeting.","type":"content","url":"/governance#institutional-partners-and-funding","position":21},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl2":"Changing the Governance Documents"},"type":"lvl2","url":"/governance#changing-the-governance-documents","position":22},{"hierarchy":{"lvl1":"Previous Governance of Project Jupyter","lvl2":"Changing the Governance Documents"},"content":"Changes to the governance documents are submitted via a GitHub pull\nrequest to The Project’s governance documents GitHub repository at\n\n\nhttps://​github​.com​/jupyter​/governance.\nThere are two phases to the process:\n\nThe discussion phase begins when the person first opens a pull-request.\nDuring this time, the pull-request must be in a draft state. The pull\nrequest is refined in response to public comment and review, with the goal\nbeing consensus in the community.\n\nThe pull request author may call a vote when they believe enough feedback\nand iteration has occurred. This is triggered by moving the pull request from\nthe draft state to an active state. This triggers the voting phase.\n\nThe voting phase begins when the PR enters an active state. The proposed\nchanges in the pull request are frozen, and may not be substantively modified\nafter voting has begun. During the voting phase, the Steering Council votes on\nwhether the changes are ratified and the pull request merged (accepting the\nproposed changes) or that the pull request be closed without merging\n(rejecting the proposed changes).\n\nAll votes are limited in time to 4 weeks after the voting phase begins. At the end of 4\nweeks, the proposal passes if 2/3 of the votes are in favor (fractions of a\nvote rounded up to the nearest integer); otherwise the proposal is rejected and\nthe PR is closed. Prior to the four-week limit, if at least 80% of the Steering Council\nhas voted and 2/3 of the votes are in favor (fractions of a vote rounded up to the nearest integer), the proposal passes. Since the BDFL holds ultimate\nauthority in The Project, the BDFL has authority to act alone in accepting or\nrejecting changes or overriding Steering Council decisions.","type":"content","url":"/governance#changing-the-governance-documents","position":23},{"hierarchy":{"lvl1":"Transition: Bootstrapping Executive Council and New Governance"},"type":"lvl1","url":"/bootstrapping-executive-council","position":0},{"hierarchy":{"lvl1":"Transition: Bootstrapping Executive Council and New Governance"},"content":"Note\n\nThis document outlines how Project Jupyter transitioned to a new governance model and formed an initial Executive Council in December 2022.","type":"content","url":"/bootstrapping-executive-council","position":1},{"hierarchy":{"lvl1":"Transition: Bootstrapping Executive Council and New Governance","lvl2":"Scope and overview"},"type":"lvl2","url":"/bootstrapping-executive-council#scope-and-overview","position":2},{"hierarchy":{"lvl1":"Transition: Bootstrapping Executive Council and New Governance","lvl2":"Scope and overview"},"content":"This document describes the process of creating the initial Executive Council (EC) that will replace the current Steering Council and BDFL, and the timelines of when related governing bodies, such as the Software Steering Council (SSC), all become active, resulting in a complete transition from Jupyter’s existing governance (as of June 2022) into a new model.","type":"content","url":"/bootstrapping-executive-council#scope-and-overview","position":3},{"hierarchy":{"lvl1":"Transition: Bootstrapping Executive Council and New Governance","lvl2":"Mechanics"},"type":"lvl2","url":"/bootstrapping-executive-council#mechanics","position":4},{"hierarchy":{"lvl1":"Transition: Bootstrapping Executive Council and New Governance","lvl2":"Mechanics"},"content":"To create the initial Executive Council, we will use the following process:\n\nFernando Pérez, Brian Granger, and Afshin Darian will start as initial members of the EC and will serve two-year terms. Their initial appointment does not count towards the running total of members elected by the EC or Union of Councils (UofC).\n\nThe collation and maintenance of the list of all eligible candidates and voters in Executive Council elections is the responsibility of the EC.\n\nIn the first EC election, three additional people will be elected and will serve one-year terms. Two of these will be selected by the UofC election, and one will be elected by the initial EC (i.e., Fernando, Brian, and Darian).\n\nThe dates of the EC nomination, election, and term start will be determined after this document is accepted, and are intended to be as soon as logistically possible.\n\nAt the start of the EC term, the SSC will also be officially recognized and the Jupyter Steering Council will be dissolved. This completes the transition to the new governance model.","type":"content","url":"/bootstrapping-executive-council#mechanics","position":5},{"hierarchy":{"lvl1":"Transition: Bootstrapping Executive Council and New Governance","lvl2":"Implications/questions"},"type":"lvl2","url":"/bootstrapping-executive-council#implications-questions","position":6},{"hierarchy":{"lvl1":"Transition: Bootstrapping Executive Council and New Governance","lvl2":"Implications/questions"},"content":"The choice of Fernando, Brian, and Darian as initial members is allocated by the current Steering Council upon voting for this document. This is why their initial membership does not count towards the running election tally of later members chosen either by the EC or the UofC.\n\nThe special-case constraint on having three new members serve only a 1-year term is intended to ensure that, moving forward, there’s a regular 2-year term default with 50% of the EC seats becoming vacant every year.\n\nSubprojects are highly encouraged to form their council and select their SSC representative as soon as possible, since Subproject council members participate in the EC election as members of the UofC.\n\nThe initial three members (Fernando, Brian, Darian) of the EC will run an election for the remaining three members of the EC as stated above, in parallel with Subprojects selecting SSC representatives, to avoid any unnecessary delays.","type":"content","url":"/bootstrapping-executive-council#implications-questions","position":7},{"hierarchy":{"lvl1":"Transition: Bootstrapping Subproject Councils"},"type":"lvl1","url":"/bootstrapping-subproject-councils","position":0},{"hierarchy":{"lvl1":"Transition: Bootstrapping Subproject Councils"},"content":"Note\n\nThis document outlines how Subprojects initially formed their councils, as part of the transition to the Jupyter governance model in December 2022.\n\nAs the new Jupyter governance model is approved and implemented, we are moving from an informal Subproject governance model to a formal model. As part of this process, each Jupyter Subproject will need to establish a formal Subproject Council as its decision-making body, including deciding its size and who its members are. There are a number of challenges associated with this:\n\nMost Subprojects do not currently have a well-defined decision process or decision-making body.\n\nThere is a wide range of Subproject community sizes and activity—some have only a few contributors and infrequent commits, while others have dozens of developers and daily activity.\n\nWe are proposing to establish new Subprojects for certain areas of Project Jupyter (or combining related areas) that do not have an existing history of informal governance.\n\nThe new governance model and \n\ndecision-making guide is designed to support large, highly participatory councils. As such, even Subprojects that have a clear decision-making body today may wish to increase the size of that body to include more contributors.\n\nWe wish to avoid each Subproject having layers of meta consensus or voting to establish very different processes for electing their council.\n\nWe wish to involve the current Steering Council in forming Subproject Councils.","type":"content","url":"/bootstrapping-subproject-councils","position":1},{"hierarchy":{"lvl1":"Transition: Bootstrapping Subproject Councils","lvl2":"Proposed framework"},"type":"lvl2","url":"/bootstrapping-subproject-councils#proposed-framework","position":2},{"hierarchy":{"lvl1":"Transition: Bootstrapping Subproject Councils","lvl2":"Proposed framework"},"content":"We propose the following framework for Subprojects to establish and bootstrap their formal councils. This framework is a suggested process and guiding set of principles that can be adapted to a particular Subproject’s existing circumstances. The Governance Working Group will be available to meet with any Subproject to openly discuss how the Subproject can best use and adapt these ideas to their existing structure and needs.\n\nThe overall principle of this framework is to gradually grow the council from a trusted, respected, and well-defined group. The process we propose is:\n\nJupyter Steering Council members will sign up to each Subproject in which they wish to be on the council. This forms the initial council for each Subproject.\n\nThe Subproject Council uses the new Decision-Making Guidelines and the principles below to decide if the next action should be:\nA. Electing a single new member to the council, in which case the process proceeds to step 3, or\nB. Stopping electing members, in which case the council is complete and the process ends.\n\nThe current council elects a single new member using the Decision-Making Guidelines and the principles below, thereby increasing the council’s size by one, and proceeds to step 2.\n\nThe bootstrapping process should observe these principles:\n\nTo address issues of multi-stakeholder governance, during the process above, successively elected members in step 3 should rotate across different organizations to avoid overrepresentation of a single organization in a stage of the process.\n\nSubproject Councils should be inclusive and as large as necessary to give voice to contributors who are actively working on the Subproject or working group. This should be evaluated in both steps 2 and 3 of the process above.\n\nThis process has the following characteristics:\n\nBy seeding each council from the current Steering Council, we start each process from a clear starting point.\n\nBy gradually increasing the size of the council one person at a time, the power implicit in this election process is gradually distributed over a larger group of people.\n\nAt each stage where the new council is considering adding a new person, they can also choose to stop electing additional members. This allows the group to decide on the overall size in an organic, gradual manner.\n\nAt each step, issues of diversity and inclusion of the council are considered.","type":"content","url":"/bootstrapping-subproject-councils#proposed-framework","position":3},{"hierarchy":{"lvl1":"Community Building Working Group"},"type":"lvl1","url":"/communitybuildingworkinggroup","position":0},{"hierarchy":{"lvl1":"Community Building Working Group"},"content":"The Jupyter Community Building Working Group (JCB) acts on behalf of the Project\nJupyter Executive Council with the objective of growing, building, and\nconnecting the Jupyter community of users and contributors. A targeted outcome\nof this working group’s efforts is to improve the diversity, equity, and\ninclusion of our community, in collaboration with the Jupyter Diversity, Equity,\nand Inclusion (DEI) standing committee.\n\nThe current members of the Jupyter Community Building Working Group are listed in the \n\nLeadership Directory.\n\nClick here for JCB reports and meeting minutes\n\nThere is more information about meeting minutes and reports on group activities in the linked page.\nThis page is the charter for the Jupyter Community Building Working Group.","type":"content","url":"/communitybuildingworkinggroup","position":1},{"hierarchy":{"lvl1":"Community Building Working Group","lvl2":"Areas of responsibility"},"type":"lvl2","url":"/communitybuildingworkinggroup#areas-of-responsibility","position":2},{"hierarchy":{"lvl1":"Community Building Working Group","lvl2":"Areas of responsibility"},"content":"","type":"content","url":"/communitybuildingworkinggroup#areas-of-responsibility","position":3},{"hierarchy":{"lvl1":"Community Building Working Group","lvl3":"Jupyter Community Workshops","lvl2":"Areas of responsibility"},"type":"lvl3","url":"/communitybuildingworkinggroup#jupyter-community-workshops","position":4},{"hierarchy":{"lvl1":"Community Building Working Group","lvl3":"Jupyter Community Workshops","lvl2":"Areas of responsibility"},"content":"The Jupyter Community Workshop program was established in 2018 to bring\ntogether small groups of Jupyter community members and core contributors for\nhigh-impact strategic work and community engagement on focused topics. These\nin-person events are particularly useful for tackling challenging development\nand design projects, growing the community of contributors, and strengthening\ncollaborations.\n\nThis working group will manage the Jupyter Community Workshop program operations\nand budget.","type":"content","url":"/communitybuildingworkinggroup#jupyter-community-workshops","position":5},{"hierarchy":{"lvl1":"Community Building Working Group","lvl3":"JupyterCon","lvl2":"Areas of responsibility"},"type":"lvl3","url":"/communitybuildingworkinggroup#jupytercon","position":6},{"hierarchy":{"lvl1":"Community Building Working Group","lvl3":"JupyterCon","lvl2":"Areas of responsibility"},"content":"Global JupyterCon conferences provide opportunities for the Jupyter community\nto come together to learn and share.\n\nThis working group will champion the strategy and oversee broad operational\naspects of JupyterCon, including event operations and community leadership for\nthe event.","type":"content","url":"/communitybuildingworkinggroup#jupytercon","position":7},{"hierarchy":{"lvl1":"Community Building Working Group","lvl3":"Operations and Budget","lvl2":"Areas of responsibility"},"type":"lvl3","url":"/communitybuildingworkinggroup#operations-and-budget","position":8},{"hierarchy":{"lvl1":"Community Building Working Group","lvl3":"Operations and Budget","lvl2":"Areas of responsibility"},"content":"This working group will collaborate with the Jupyter Executive Council to serve\nas stewards for Project Jupyter funds for events in this committee’s purview.","type":"content","url":"/communitybuildingworkinggroup#operations-and-budget","position":9},{"hierarchy":{"lvl1":"Community Building Working Group","lvl3":"Diversity, Equity, Inclusion","lvl2":"Areas of responsibility"},"type":"lvl3","url":"/communitybuildingworkinggroup#diversity-equity-inclusion","position":10},{"hierarchy":{"lvl1":"Community Building Working Group","lvl3":"Diversity, Equity, Inclusion","lvl2":"Areas of responsibility"},"content":"Project Jupyter is an engaged and respectful community made up of people from\nall over the world. This working group pledges to foster a productive,\nharassment-free environment for everyone who participates in organizing or\nattending our events. We recognize our work is a highly visible and\npotentially impactful way for diversity, equity, and inclusion (DEI) efforts\nto be championed within our global community.\n\nIn particular, this working group will:\n\nCollaborate with the Jupyter Diversity, Equity, and Inclusion (DEI)\nstanding committee to find new ways to make a positive impact in\nProject Jupyter.\n\nPartner with the DEI standing committee to train and mentor community event\nleadership in DEI efforts for their events.\n\nHelp the DEI standing committee measure impact of DEI efforts in Jupyter events where feasible.","type":"content","url":"/communitybuildingworkinggroup#diversity-equity-inclusion","position":11},{"hierarchy":{"lvl1":"Community Building Working Group","lvl2":"Reporting"},"type":"lvl2","url":"/communitybuildingworkinggroup#reporting","position":12},{"hierarchy":{"lvl1":"Community Building Working Group","lvl2":"Reporting"},"content":"This working group will report to the Executive Council quarterly on all areas of\nresponsibility, including activities, finances, and DEI efforts. This\nworking group will also publish an annual blog post for the broader global\ncommunity.","type":"content","url":"/communitybuildingworkinggroup#reporting","position":13},{"hierarchy":{"lvl1":"Community Building Working Group","lvl2":"Membership"},"type":"lvl2","url":"/communitybuildingworkinggroup#membership","position":14},{"hierarchy":{"lvl1":"Community Building Working Group","lvl2":"Membership"},"content":"Members of this working group will be elected by the existing working group\nfollowing the Jupyter guidelines for forming and perpetuating a decision-making\nbody, subject to approval by the Executive Council.","type":"content","url":"/communitybuildingworkinggroup#membership","position":15},{"hierarchy":{"lvl1":"Project Jupyter Code of Conduct"},"type":"lvl1","url":"/code-of-conduct","position":0},{"hierarchy":{"lvl1":"Project Jupyter Code of Conduct"},"content":"Project Jupyter is an engaged and respectful community made up of people\nfrom all over the world. Your involvement helps us to further our\nmission and to create an open platform that serves a broad range of\ncommunities, from research and education, to journalism, industry and\nbeyond.\n\nNaturally, this implies diversity of ideas and perspectives on often complex\nproblems. Disagreement and healthy discussion of conflicting viewpoints are\nwelcome: the best solutions to hard problems rarely come from a single angle.\nBut disagreement is not an excuse for aggression: humans tend to take\ndisagreement personally and easily drift into behavior that ultimately degrades\na community. This is particularly acute with online communication across\nlanguage and cultural gaps, where many cues of human behavior are unavailable.\nWe are outlining here a set of principles and processes to support a\nhealthy community in the face of these challenges.\n\nFundamentally, we are committed to fostering a productive, harassment-free\nenvironment for everyone. Rather than considering this code an exhaustive list\nof things that you can’t do, take it in the spirit it is intended - a guide to\nmake it easier to enrich all of us and the communities in which we participate.\n\nImportantly: as a member of our community, you are also a steward of these\nvalues.  Not all problems need to be resolved via formal processes, and often\na quick, friendly but clear word on an online forum or in person can help\nresolve a misunderstanding and de-escalate things.\n\nHowever, sometimes these informal processes may be inadequate: they fail to\nwork, there is urgency or risk to someone, nobody is intervening publicly and\nyou don’t feel comfortable speaking in public, etc.  For these or other\nreasons, structured follow-up may be necessary and here we provide the means\nfor that as described in the \n\nReporting section.\n\nThis code applies equally to founders, developers, mentors and new community\nmembers, in all spaces managed by Project Jupyter (including IPython). This\nincludes the mailing lists, our GitHub organizations, our chat rooms, in-person\nevents, the \n\nDiscourse community forum,\nand any other forums created by the project team. In addition,\nviolations of this code outside these spaces may affect a person’s ability to\nparticipate within them.","type":"content","url":"/code-of-conduct","position":1},{"hierarchy":{"lvl1":"Project Jupyter Code of Conduct","lvl2":"Expected behavior"},"type":"lvl2","url":"/code-of-conduct#expected-behavior","position":2},{"hierarchy":{"lvl1":"Project Jupyter Code of Conduct","lvl2":"Expected behavior"},"content":"By embracing the following principles, guidelines and actions to follow or\navoid, you will help us make Jupyter a welcoming and productive community. Feel\nfree to contact the Code of Conduct Committee at\n\n\nconduct@jupyter.org with any questions.\n\nBe friendly and patient.\n\nBe welcoming. We strive to be a community that welcomes and supports\npeople of all backgrounds and identities. This includes, but is not limited\nto, members of any race, ethnicity, culture, national origin, color,\nimmigration status, social and economic class, educational level, sex, sexual\norientation, gender identity and expression, age, physical appearance, family\nstatus, technological or professional choices, academic\ndiscipline, religion, mental ability, and physical ability.\n\nBe considerate. Your work will be used by other people, and you in turn\nwill depend on the work of others. Any decision you take will affect users\nand colleagues, and you should take those consequences into account when\nmaking decisions. Remember that we’re a world-wide community. You may be\ncommunicating with someone with a different primary language or cultural\nbackground.\n\nBe respectful. Not all of us will agree all the time, but disagreement is\nno excuse for poor behavior or poor manners. We might all experience some\nfrustration now and then, but we cannot allow that frustration to turn into a\npersonal attack. It’s important to remember that a community where people\nfeel uncomfortable or threatened is not a productive one.\n\nBe careful in the words that you choose. Be kind to others. Do not insult\nor put down other community members. Harassment and other exclusionary\nbehavior are not acceptable. This includes, but is not limited to:\n\nViolent threats or violent language directed against another person\n\nDiscriminatory jokes and language\n\nPosting sexually explicit or violent material\n\nPosting (or threatening to post) other people’s personally identifying\ninformation (“doxing”)\n\nPersonal insults, especially those using racist or sexist terms\n\nUnwelcome sexual attention\n\nAdvocating for, or encouraging, any of the above behavior\n\nRepeated harassment of others. In general, if someone asks you to stop,\nthen stop\n\nModerate your expectations. Please respect that community members choose\nhow they spend their time in the project. A thoughtful question about your\nexpectations is preferable to demands for another person’s time.\n\nWhen we disagree, try to understand why. Disagreements, both social and\ntechnical, happen all the time and Jupyter is no exception.  Try to\nunderstand where others are coming from, as seeing a question from their\nviewpoint may help find a new path forward.  And don’t forget that it is\nhuman to err: blaming each other doesn’t get us anywhere, while we can learn\nfrom mistakes to find better solutions.\n\nA simple apology can go a long way. It can often de-escalate a situation,\nand telling someone that you are sorry is an act of empathy that doesn’t\nautomatically imply an admission of guilt.","type":"content","url":"/code-of-conduct#expected-behavior","position":3},{"hierarchy":{"lvl1":"Project Jupyter Code of Conduct","lvl2":"Responding to inappropriate behavior"},"type":"lvl2","url":"/code-of-conduct#responding-to-inappropriate-behavior","position":4},{"hierarchy":{"lvl1":"Project Jupyter Code of Conduct","lvl2":"Responding to inappropriate behavior"},"content":"In some cases, individuals may violate the CoC in online or in-person situations.\nIf any community member deems the action to be harmful to the community,\nthey may act immediately to defuse the situation.\nThis includes actions directed at the situation, rather than at an individual, such\nas locking a thread, temporarily suspending a user’s account in the\ncommunity forum, calling a meeting break, or generally acting to\nde-escalate the situation. Follow-up your actions by\n\n\nreporting the incident to the CoC committee.\n\nIf the incident involves physical danger, or involves a threat to anyone’s safety\n(such as threats of violence), any member of the community may -- and should -- act\nunilaterally to protect the safety of any community member.\nThis can include contacting law enforcement, other members of the Jupyter community,\nor other local personnel that are present.\n\nIn situations where an individual community member acts unilaterally,\nthey must inform the Code of Conduct committee as soon as possible,\nby e-mailing\n\n\nconduct@jupyter.org\nwithin 24 hours.","type":"content","url":"/code-of-conduct#responding-to-inappropriate-behavior","position":5},{"hierarchy":{"lvl1":"Project Jupyter Code of Conduct","lvl2":"Reporting"},"type":"lvl2","url":"/code-of-conduct#reporting","position":6},{"hierarchy":{"lvl1":"Project Jupyter Code of Conduct","lvl2":"Reporting"},"content":"If you believe someone is violating the code of conduct, please report this in\na timely manner. Code of conduct violations reduce the value of the community\nfor everyone and we take them seriously.\n\nYou can file a report by emailing\n\n\nconduct@jupyter.org or by filling out\n\n\nthis form. For more details or\ninformation on reporting in-person at an event, please see our Reporting\nGuidelines (for \n\nonline and\n\n\nin-person contexts).\n\nThe online form gives you the option to keep your report anonymous or request\nthat we follow up with you directly. While we cannot follow up on an anonymous\nreport, we will take appropriate action.","type":"content","url":"/code-of-conduct#reporting","position":7},{"hierarchy":{"lvl1":"Project Jupyter Code of Conduct","lvl2":"Enforcement"},"type":"lvl2","url":"/code-of-conduct#enforcement","position":8},{"hierarchy":{"lvl1":"Project Jupyter Code of Conduct","lvl2":"Enforcement"},"content":"For information on enforcement, please view the \n\nEnforcement\nManual.\n\nOriginal text courtesy of the \n\nSpeak\nUp!\nand \n\nDjango Projects,\nmodified by Project Jupyter.  We are grateful to those projects for contributing these materials under open licensing terms for us to easily reuse.\n\nAll content on this page is licensed under a \n\nCreative Commons\nAttribution license.","type":"content","url":"/code-of-conduct#enforcement","position":9},{"hierarchy":{"lvl1":"Enforcement Manual"},"type":"lvl1","url":"/enforcement","position":0},{"hierarchy":{"lvl1":"Enforcement Manual"},"content":"This is the enforcement manual followed by Jupyter’s Code of Conduct Committee.\nIt’s used when we respond to an incident to make sure we are consistent and\nfair.","type":"content","url":"/enforcement","position":1},{"hierarchy":{"lvl1":"Enforcement Manual","lvl2":"The Code of Conduct Committee"},"type":"lvl2","url":"/enforcement#the-code-of-conduct-committee","position":2},{"hierarchy":{"lvl1":"Enforcement Manual","lvl2":"The Code of Conduct Committee"},"content":"All responses to reports of conduct violations will be managed by a Code of\nConduct Committee (“the committee”). The \n\nJupyter Executive Council is responsible\nfor vetting and appointing the Code of Conduct Committee. During periods where\na separate Code of Conduct Committee is not appointed or is not available\nto handle a code of conduct report promptly, the Jupyter Executive Council\nwill serve as the interim Code of Conduct Committee.\n\nIf a Code of Conduct report involves a member of the Executive Council or Code of\nConduct Committee, that member will not participate in the investigation or any\ndecisions related to that report.","type":"content","url":"/enforcement#the-code-of-conduct-committee","position":3},{"hierarchy":{"lvl1":"Enforcement Manual","lvl2":"Enforcement guidelines and principles"},"type":"lvl2","url":"/enforcement#enforcement-guidelines-and-principles","position":4},{"hierarchy":{"lvl1":"Enforcement Manual","lvl2":"Enforcement guidelines and principles"},"content":"Enforcing the Code of Conduct impacts our community today and for the future.\nIt’s an action that we do not take lightly. When reviewing enforcement\nmeasures, the Code of Conduct Committee will keep the following values and\nguidelines in mind:\n\nAct in a personal manner rather than impersonal.  The Committee can engage\nthe parties to understand the situation, while respecting the privacy and any\nnecessary confidentiality of reporters.  However, sometimes it is necessary\nto communicate with one or more individuals directly: the Committee’s goal is\nto improve the health of our community rather than only produce a formal\ndecision.\n\nEmphasize empathy for individuals rather than judging behavior, avoiding\nbinary labels of “good” and “bad/evil”. Overt, clear-cut aggression and\nharassment exists and will be addressed unambiguously.  But many scenarios\nthat can prove challenging to resolve are those where normal disagreements\ndevolve into inappropriate behavior from multiple parties.  Understanding the\nfull context and finding a path that re-engages all is hard, but ultimately\nthe most productive for our community.\n\nHelp increase engagement in good discussion practice: try to identify where\ndiscussion may have broken down and provide actionable information, pointers\nand resources that can help enact positive change on these points.\n\nBe mindful of the needs of new members: provide them with explicit support\nand consideration, with the aim of increasing participation from\nunderrepresented groups in particular.\n\nIndividuals come from different cultural backgrounds and native languages.\nWhile lack of intent to harm is not an excuse, try to identify any honest\nmisunderstandings caused by a non-native speaker and help them understand the\nissue and how to change.  Complex discussion in a foreign language can be\nvery intimidating, and we want to grow our diversity also across\nnationalities and cultures.\n\nOur actions will reflect compassion for all individuals. We will seek to\nunderstand, to educate, and, as necessary, take action.\n\nMediation: voluntary, informal mediation is a tool at our disposal.  In\ncontexts such as when two or more parties have all escalated to the point of\ninappropriate behavior (something sadly common in human conflict), it may be\nuseful to facilitate a mediation process. This is only an example: the\nCommittee can consider mediation in any case, mindful that the process is meant\nto be strictly voluntary and no party can be pressured to participate. If the\nCommittee suggests mediation, it should:\n\nFind a candidate who can serve as a mediator.\n\nObtain the agreement of the reporter(s). The reporter(s) have complete\nfreedom to decline the mediation idea, or to propose an alternate mediator.\n\nObtain the agreement of the reported person(s).\n\nSettle on the mediator: while parties can propose a different mediator than\nthe suggested candidate, only if common agreement is reached on all terms can\nthe process move forward.\n\nEstablish a timeline for mediation to complete, ideally within two weeks.\n\nThe mediator will engage with all the parties and seek a resolution that is\nsatisfactory to all.  Upon completion, the mediator will provide a report\n(vetted by all parties to the process) to the Committee, with recommendations\non further steps.  The Committee will then evaluate these results (whether\nsatisfactory resolution was achieved or not) and decide on any additional\naction deemed necessary.","type":"content","url":"/enforcement#enforcement-guidelines-and-principles","position":5},{"hierarchy":{"lvl1":"Enforcement Manual","lvl2":"How the committee will respond to reports"},"type":"lvl2","url":"/enforcement#how-the-committee-will-respond-to-reports","position":6},{"hierarchy":{"lvl1":"Enforcement Manual","lvl2":"How the committee will respond to reports"},"content":"When a report is sent to the committee they will immediately reply to the\nreporter to confirm receipt. This reply must be sent within 24 hours, and the\ngroup should strive to respond much quicker than that.\n\nSee the \n\nReporting Guidelines for details of\nwhat reports should contain. If a report doesn’t contain enough information, the\ncommittee will obtain all relevant data before acting. The committee is\nempowered to act on the Executive Council’s behalf in contacting any individuals\ninvolved to get a more complete account of events.\n\nThe committee will then review the incident and determine, to the best of their\nability:\n\nWhat happened.\n\nWhether this event constitutes a Code of Conduct violation.\n\nWho are the responsible party(ies).\n\nWhether this is an ongoing situation, and there is a threat to anyone’s\nphysical safety.\n\nThis information will be collected in writing, and whenever possible the\ngroup’s deliberations will be recorded and retained (i.e. chat transcripts,\nemail discussions, recorded conference calls, summaries of voice conversations,\netc).\n\nIt is important to retain an archive of all activities of this committee to\nensure consistency in behavior and provide institutional memory for the\nproject.  To assist in this, the default channel of discussion for this\ncommittee will be a private mailing list accessible to current and future\nmembers of the committee as well as members of the Executive Council upon\njustified request. If the Committee finds the need to use off-list\ncommunications (e.g. phone calls for early/rapid response), it should in all\ncases summarize these back to the list so there’s a good record of the process.\n\nThe Code of Conduct Committee should aim to have a resolution agreed upon within\none week. In the event that a resolution can’t be determined in that time, the\ncommittee will respond to the reporter(s) with an update and projected timeline\nfor resolution.","type":"content","url":"/enforcement#how-the-committee-will-respond-to-reports","position":7},{"hierarchy":{"lvl1":"Enforcement Manual","lvl2":"Incident Response and Committee Actions"},"type":"lvl2","url":"/enforcement#incident-response-and-committee-actions","position":8},{"hierarchy":{"lvl1":"Enforcement Manual","lvl2":"Incident Response and Committee Actions"},"content":"If the act is ongoing, or involves a threat to anyone’s safety (e.g. threats of\nviolence), any committee member may act immediately (before reaching consensus)\nto address the situation. In ongoing situations, any member may decide to employ\nany of the tools available to the committee, including bans and blocks.\n\nIf the incident involves physical danger, any member of the committee may -- and\nshould -- act unilaterally to protect the safety of those involved. This can\ninclude contacting law enforcement (or other local personnel) and speaking on\nbehalf of the Jupyter Executive Council.\n\nIn situations where an individual committee member acts unilaterally, they must\nreport their actions to the committee for review within 24 hours.\n\nAt events where no Committee members may be present, an event organizer will act\nas their delegate. They will forward any reports to the Committee, as well as a\nsummary of any action they may have taken during the event.","type":"content","url":"/enforcement#incident-response-and-committee-actions","position":9},{"hierarchy":{"lvl1":"Enforcement Manual","lvl2":"Resolutions"},"type":"lvl2","url":"/enforcement#resolutions","position":10},{"hierarchy":{"lvl1":"Enforcement Manual","lvl2":"Resolutions"},"content":"The committee must agree on a resolution by consensus. If the group cannot reach\nconsensus and deadlocks for over a week, the group will turn the matter over to\nthe Executive Council for resolution.\n\nPossible responses may include:\n\nTaking no further action\n\nif we determine no violations have occurred.\n\nif the matter has been resolved publicly while the committee was\nconsidering responses.\n\nCoordinating voluntary mediation: if all involved parties agree, the\nCommittee may facilitate a mediation process as detailed above.\n\nRemind publicly, and point out that some behavior/actions/language have been\njudged inappropriate and why in the current context, or can but hurtful to\nsome people, requesting the community to self-adjust.\n\nA private reprimand from the committee to the individual(s) involved. In this\ncase, the group chair will deliver that reprimand to the individual(s) over\nemail, cc’ing the group.\n\nA public reprimand. In this case, the committee chair will deliver that\nreprimand in the same venue that the violation occurred, within the limits of\npracticality. E.g., the original mailing list for an email violation, but\nfor a chat room discussion where the person/context may be gone, they can be\nreached by other means. The group may choose to publish this message\nelsewhere for documentation purposes.\n\nA request for a public or private apology, assuming the reporter agrees to\nthis idea: they may at their discretion refuse further contact with the\nviolator. The chair will deliver this request. The committee may, if it\nchooses, attach “strings” to this request: for example, the group may ask a\nviolator to apologize in order to retain one’s membership on a mailing list.\n\nA “mutually agreed upon hiatus” where the committee asks the individual to\ntemporarily refrain from community participation. If the individual chooses\nnot to take a temporary break voluntarily, the committee may issue a\n“mandatory cooling off period”.\n\nA permanent or temporary ban from some or all Jupyter spaces (mailing lists,\n\n\ngitter.im, etc.). The group will maintain records of all such bans so that\nthey may be reviewed in the future or otherwise maintained.\n\nOnce a resolution is agreed upon, but before it is enacted, the committee will\ncontact the original reporter and any other affected parties and explain the\nproposed resolution. The committee will ask if this resolution is acceptable,\nand must note feedback for the record. However, the committee is not required to\nact on this feedback.\n\nFinally, the committee will make a report to the Jupyter Executive Council (as\nwell as the Jupyter core team in the event of an ongoing resolution, such as a\nban).\n\nThe committee will never publicly discuss the issue; all public statements will\nbe made by the chair of the Code of Conduct Committee or the Jupyter Executive\nCouncil.","type":"content","url":"/enforcement#resolutions","position":11},{"hierarchy":{"lvl1":"Enforcement Manual","lvl2":"Conflicts of Interest"},"type":"lvl2","url":"/enforcement#conflicts-of-interest","position":12},{"hierarchy":{"lvl1":"Enforcement Manual","lvl2":"Conflicts of Interest"},"content":"In the event of any conflict of interest, a committee member must immediately\nnotify the other members, and recuse themselves if necessary.","type":"content","url":"/enforcement#conflicts-of-interest","position":13},{"hierarchy":{"lvl1":"Frequently Asked Questions"},"type":"lvl1","url":"/faq","position":0},{"hierarchy":{"lvl1":"Frequently Asked Questions"},"content":"This FAQ attempts to address common questions and concerns around the Jupyter\ncommunity’s Code of Conduct. If you still have questions after reading it,\nplease feel free to contact us at\n\n\nconduct@jupyter.org.","type":"content","url":"/faq","position":1},{"hierarchy":{"lvl1":"Frequently Asked Questions","lvl2":"Why have you adopted a Code of Conduct?"},"type":"lvl2","url":"/faq#why-have-you-adopted-a-code-of-conduct","position":2},{"hierarchy":{"lvl1":"Frequently Asked Questions","lvl2":"Why have you adopted a Code of Conduct?"},"content":"We think the Jupyter community is awesome. If you’re familiar with the Jupyter\ncommunity, you’ll probably notice that the Code basically matches what we\nalready do. Think of this as documentation: we’re taking implicit expectations\nabout behavior and making them explicit.\n\nWe’re doing this because the Jupyter community is growing faster than any of us\ncould have anticipated. This is on balance a very positive thing, but as we’ve\ngrown past the point where it’s possible to know the whole community, we think\nit’s very important to be clear about our values.\n\nWe know that the Jupyter community is open, friendly, and welcoming. We want to\nmake sure everyone else knows it too.","type":"content","url":"/faq#why-have-you-adopted-a-code-of-conduct","position":3},{"hierarchy":{"lvl1":"Frequently Asked Questions","lvl2":"What does it mean to “adopt” a Code of Conduct?"},"type":"lvl2","url":"/faq#what-does-it-mean-to-adopt-a-code-of-conduct","position":4},{"hierarchy":{"lvl1":"Frequently Asked Questions","lvl2":"What does it mean to “adopt” a Code of Conduct?"},"content":"For the most part, we don’t think it means large changes. We think that the text\ndoes a really good job describing the way the Jupyter community already conducts\nitself. We expect that most people will simply continue to behave as they have\nin the past.\n\nHowever, we do expect that people will abide by the spirit and words of the Code\nof Conduct when in “official” Jupyter spaces. This code has been adopted by both\nthe Jupyter Executive Council and JupyterDay/JupyterCon events. That means that\nit will apply both in community spaces and at our events.\n\nIn practice, Jupyter spaces include mailing lists, various communication\nchannels, and events.","type":"content","url":"/faq#what-does-it-mean-to-adopt-a-code-of-conduct","position":5},{"hierarchy":{"lvl1":"Frequently Asked Questions","lvl2":"What happens if someone violates the Code of Conduct?"},"type":"lvl2","url":"/faq#what-happens-if-someone-violates-the-code-of-conduct","position":6},{"hierarchy":{"lvl1":"Frequently Asked Questions","lvl2":"What happens if someone violates the Code of Conduct?"},"content":"We are all stewards of our community, and are encouraged to participate in ways\nthat defend the values highlighted in this document and help others understand\nwhen their actions go against these values (by engaging them and directing them\nto this document if necessary). If that doesn’t work, or if you need more help,\nyou can contact \n\nconduct@jupyter.org. For more details please see our \n\nReporting\nGuidelines.","type":"content","url":"/faq#what-happens-if-someone-violates-the-code-of-conduct","position":7},{"hierarchy":{"lvl1":"Frequently Asked Questions","lvl2":"What about events funded by Project Jupyter?"},"type":"lvl2","url":"/faq#what-about-events-funded-by-project-jupyter","position":8},{"hierarchy":{"lvl1":"Frequently Asked Questions","lvl2":"What about events funded by Project Jupyter?"},"content":"This Code of Conduct will also cover any events that Project Jupyter funds.\n\nThe project requires that any events Project Jupyter funds have policies and\nprocedures in place for handling harassment. It’s especially important to us\nthat real-life events take steps to protect the physical and mental security of\ntheir participants.\n\nEvent organizers will enforce the Code of Conduct.","type":"content","url":"/faq#what-about-events-funded-by-project-jupyter","position":9},{"hierarchy":{"lvl1":"Frequently Asked Questions","lvl2":"Why do we need a Code of Conduct? Everyone knows not to be a jerk."},"type":"lvl2","url":"/faq#why-do-we-need-a-code-of-conduct-everyone-knows-not-to-be-a-jerk","position":10},{"hierarchy":{"lvl1":"Frequently Asked Questions","lvl2":"Why do we need a Code of Conduct? Everyone knows not to be a jerk."},"content":"Sadly, not everyone knows this.\n\nHowever, even if everyone was kind, everyone was compassionate, and everyone was\nfamiliar with codes of conduct it would still be incumbent upon our community to\npublish our own. Maintaining a Code of Conduct forces us to consider and\narticulate what kind of community we want to be, and serves as a constant\nreminder to put our best foot forward. But most importantly, it serves as a\nsignpost to people looking to join our community that we feel these values are\nimportant.","type":"content","url":"/faq#why-do-we-need-a-code-of-conduct-everyone-knows-not-to-be-a-jerk","position":11},{"hierarchy":{"lvl1":"Frequently Asked Questions","lvl2":"This is censorship! I have the right to say whatever I want!"},"type":"lvl2","url":"/faq#this-is-censorship-i-have-the-right-to-say-whatever-i-want","position":12},{"hierarchy":{"lvl1":"Frequently Asked Questions","lvl2":"This is censorship! I have the right to say whatever I want!"},"content":"You do -- in your space. If you’d like to hang out in our spaces, we have some\nsimple guidelines to follow. If you want to, for example, form a group where\nJupyter is discussed using language inappropriate for general channels then\nnobody’s stopping you. We respect your right to establish whatever codes of\nconduct you want in the spaces that belong to you. Please honor this Code of\nConduct in our spaces.","type":"content","url":"/faq#this-is-censorship-i-have-the-right-to-say-whatever-i-want","position":13},{"hierarchy":{"lvl1":"Reporting Guide - Jupyter Events"},"type":"lvl1","url":"/reporting-events","position":0},{"hierarchy":{"lvl1":"Reporting Guide - Jupyter Events"},"content":"You can make a personal report by:\n\nPhone: Provided at beginning of your event. This phone number will be\nmonitored for the duration of the event.\n\nIn Person: Contact a staff member. Staff members should be clearly\nidentified in an event (for example, with special staff badges or shirts).\n\nWhen taking a personal report, event staff will ensure you are safe and cannot be\noverheard. They may involve other event staff to ensure your report is managed\nproperly. This can be uncomfortable, but we’ll handle it respectfully and you\ncan bring someone to support you.\n\nEmail: Send a message to\n\n\nconduct@jupyter.org and/or a local organizer’s\nemail (best to do both to ensure both prompt local response and that the\nregular committee is immediately in the loop).\n\nOur team will help you contact hotel/venue security, local law enforcement,\nlocal support (which could include services and transportation as available), or\notherwise respectfully assist you to feel safe for the duration of the event.\n\nContact information for the following will be provided per event:\n\nEmail: \n\nconduct@jupyter.org, and/or a local\norganizer\n\nConference organizer mobile number\n\nVenue security\n\nLaw enforcement\n\nLocal sexual assault hot line\n\nNon-emergency medical (e.g., urgent care, day clinic)\n\nTaxi","type":"content","url":"/reporting-events","position":1},{"hierarchy":{"lvl1":"Reporting Guide - Jupyter Events","lvl2":"At a Jupyter Event:"},"type":"lvl2","url":"/reporting-events#at-a-jupyter-event","position":2},{"hierarchy":{"lvl1":"Reporting Guide - Jupyter Events","lvl2":"At a Jupyter Event:"},"content":"Participants asked to stop any harassing behavior are expected to comply\nimmediately.\n\nIf a participant engages in harassing behavior, event organizers retain the\nright to take any actions to keep the event a welcoming environment for all\nparticipants. This includes warning the offender or expulsion from the\nconference with no refund.\n\nEvent organizers may take action to remedy or set right anything designed to,\nor with the clear impact of, disrupting the event or making the environment\nhostile for any participants.\n\nYou also have the option of following the reporting procedure for the online\ncommunity found \n\nhere. Just be aware\nthe response and action may not be as prompt.","type":"content","url":"/reporting-events#at-a-jupyter-event","position":3},{"hierarchy":{"lvl1":"Reporting Guide - Online Community"},"type":"lvl1","url":"/reporting-online","position":0},{"hierarchy":{"lvl1":"Reporting Guide - Online Community"},"content":"If you believe someone is violating the code of conduct we ask that you report\nit to Project Jupyter by emailing\n\n\nconduct@jupyter.org or by completing \n\nthis\nform. All reports will be kept\nconfidential. Code of Conduct reports are currently reviewed by the \n\nExecutive Council. In some cases we may determine that a public statement will need\nto be made. If that’s the case, the identities of all involved will remain\nconfidential unless those individuals instruct us otherwise.\n\nIf you believe anyone is in physical danger, please notify appropriate law\nenforcement first. If you are unsure what law enforcement agency is appropriate,\nplease include this in your report and we will attempt to notify them.\n\nIf you choose to email instead of using the form, please include the following\ninformation:\n\nYour contact info (not required, if you would like to remain anonymous please\nuse the form)\n\nNames (real, nicknames, or pseudonyms) of any individuals involved. If there\nwere other witnesses besides you, try to include them as well\n\nWhen and where the incident occurred. Please be as specific as possible.\n\nYour account of what occurred. If there is a publicly available record (e.g. a\nmailing list archive or GitHub/gitter.im) please include a link\n\nAny extra context you believe exists for the incident\n\nIf you believe this incident is ongoing\n\nAny other information you believe we should have\n\nNote: with anonymous reports, there are inherent limits in our ability to do\nfollow-up or collect additional information.  Hence we suggest that if you\nwould like to remain anonymous, you at least create a throw-away email address\nwithout your real name.","type":"content","url":"/reporting-online","position":1},{"hierarchy":{"lvl1":"Reporting Guide - Online Community","lvl2":"What happens after you file a report?"},"type":"lvl2","url":"/reporting-online#what-happens-after-you-file-a-report","position":2},{"hierarchy":{"lvl1":"Reporting Guide - Online Community","lvl2":"What happens after you file a report?"},"content":"You will receive an email from the Project Jupyter Code of Conduct Committee\nacknowledging receipt immediately. We promise to acknowledge receipt within 24\nhours (and will aim for much quicker than that).\n\nThe working group will immediately meet to review the incident and determine:\n\nWhat happened\n\nWhether this event constitutes a Code of Conduct violation\n\nWho the individual(s) involved were\n\nWhether this is an ongoing situation, or if there is a threat to anyone’s\nphysical safety\n\nIf this is determined to be an ongoing incident or a threat to physical safety,\nthe committee’s immediate priority will be to protect everyone involved. This\nmeans we may delay an “official” response until we believe that the situation\nhas ended and that everyone is physically safe.\n\nThe Code of Conduct committee will then follow the\n\n\nstandard procedure to arrive at and\ncommunicate a resolution.","type":"content","url":"/reporting-online#what-happens-after-you-file-a-report","position":3},{"hierarchy":{"lvl1":"Reporting Guide - Online Community","lvl2":"Appealing the Code of Conduct Committee’s Response"},"type":"lvl2","url":"/reporting-online#appealing-the-code-of-conduct-committees-response","position":4},{"hierarchy":{"lvl1":"Reporting Guide - Online Community","lvl2":"Appealing the Code of Conduct Committee’s Response"},"content":"To appeal a decision of the Code of Conduct Committee, contact the Jupyter\nExecutive Council at\n\n\nsteeringcouncil@jupyter.org with your\nappeal and they will review the case.\n\nThe Executive Council will gather all relevant information from the Committee\nand provide a resolution within two weeks.  If more time is required, it should\ninform the appellant within that time frame.","type":"content","url":"/reporting-online#appealing-the-code-of-conduct-committees-response","position":5},{"hierarchy":{"lvl1":"Decision-Making Guide"},"type":"lvl1","url":"/decision-making","position":0},{"hierarchy":{"lvl1":"Decision-Making Guide"},"content":"This document describes how Jupyter’s governing bodies (generally called “councils”) make decisions. Because individuals often work across multiple decision-making groups, all Jupyter governing bodies are expected to follow this approach.\n\nWe seek to honor the principles of collaboration, inclusive participation, and responsive decision making. Some aspects of this decision-making guide are required of all teams. Others are provided as recommendations and are optional. We have clearly noted the optional aspects of decision making below.\n\nFinally, the \n\nJupyter Executive Council may either intervene, or be called upon by members of a team, in the event that issues arise in the decision-making process. This includes, but is not limited to: process ambiguity, violations of the decision-making process, mitigating circumstances that require process exceptions, etc.","type":"content","url":"/decision-making","position":1},{"hierarchy":{"lvl1":"Decision-Making Guide","lvl2":"Required aspects of decision making"},"type":"lvl2","url":"/decision-making#required-aspects-of-decision-making","position":2},{"hierarchy":{"lvl1":"Decision-Making Guide","lvl2":"Required aspects of decision making"},"content":"The decision-making process is intended to balance broad participation of stakeholders with agility. While the size of decision-making bodies may vary (e.g., software projects can range from a handful to dozens of decision makers), all need to find this balance. The guidelines below cannot fully capture the role of human judgment and discretion.\n\nAll official Jupyter projects, working groups, governing bodies, and official initiatives must have a clearly-defined and documented council. Formally, these councils make decisions using consensus seeking with an option to call a vote to move the decision forward. All decisions, whether made by informal consensus or by formal vote, may be revisited; however, if a council finds itself frequently revisting consensus-based decisions, this should be viewed as an indication that the council’s understanding of informal consensus may need to be reviewed.\n\nDepending on the council, decisions may be proposed by members of the council or by a broader group of stakeholders/contributors.\n\nInformal consensus seeking. Decision making starts with informal consensus seeking through discussion. The goal of this phase is to refine the proposal, consider alternatives, weigh trade-offs, and attempt to find informal consensus. The legitimacy of the consensus-seeking process is predicated on all stakeholders having their voices heard, so councils must be proactive in providing opportunities for all relevant stakeholders to provide input. If the council arrives at informal consensus, they may immediately move to document and enact the decision. This is the consensus-seeking phase.\n\nCalling a vote. When the discussion matures during the consensus-seeking phase, any member of the council can call the matter to a vote. When that member (the sponsor) calls the vote, they shall summarize the proposal in its current form for the entire council. After the proposal is seconded by another member of the council, members have seven days to vote. The council may consider longer voting periods as necessary for special circumstances, or shorter periods only if all voting members are present. The decision will be determined by a simple majority of non-blank votes for binary decisions (i.e., approving a proposal) and ranked choice for multi-class decisions (one among many, or several among many). The sponsor may update the proposal at any point during the voting period, in which case the voting period will be reset.\n\nVoter participation and quorum. All members of a council are required to participate in at least 2/3 of formal votes of that council per calendar year (councils can decide how to account for the specifics of this in low-activity projects, etc.). Members that have not met the 2/3 vote participation threshold for a year will automatically be asked to step down at the end of that year. Those individuals remain eligible to rejoin the council in the future as they become available to participate at the required level. The quorum for all formal votes will be 50% and a “blank” option will always be included, with the “blank” option counting towards the quorum but not included in totals for calculating results. The participation and quorum figures in this guide should be considered a minimum standard, individual councils may decide to adopt more stringent rules if appropriate.\n\nRecording. Once a decision has been made during the consensus-seeking phase or by a formal vote, the council will record the decision, e.g., in Team Compass issues for councils whose workflow is on GitHub or other equivalent and publicly visible mechanisms.","type":"content","url":"/decision-making#required-aspects-of-decision-making","position":3},{"hierarchy":{"lvl1":"Decision-Making Guide","lvl2":"Optional aspects of decision making"},"type":"lvl2","url":"/decision-making#optional-aspects-of-decision-making","position":4},{"hierarchy":{"lvl1":"Decision-Making Guide","lvl2":"Optional aspects of decision making"},"content":"While the previous section is prescriptive for all Jupyter councils, the following are recommended guidelines rather than mandatory procedures.\n\nCouncils should not call a vote to short-circuit an ongoing discussion that is still productive in terms of exploring ideas and feedback. Votes should be called only when discussion has explored the space and stakeholders have provided input.\n\nCouncils should proactively solicit input from relevant stakeholders and should not assume that silence is consent without attempting to reach out to those individuals.\n\nIf you are interested in a decision being made, it is your responsibility to encourage voting member/stakeholder/community participation in the decision-making process. If you cannot get such participation, you may want to hold off on doing any significant work on the matter.\n\nSpecial guidelines for software projects making decisions:\n\nAdd a link to this document in your issue and PR templates along with a link to the council membership (see recommended language below).\n\nCreate seeking consensus, vote, and decision made issue labels to make it easy to find issues/PRs where decisions are discussed and resolved.\n\nWhen a vote is called on GitHub, the sponsor should summarize the decision and paste a checklist of the voting members to use in voting in the top entry (description) of the issue/PR.\n\nWhen communications (in whatever number of channels) point to a discussion that requires a project-wide decision, and before major implementation work starts, a standalone issue should be opened that summarizes the issue, points to relevant prior discussions, and calls for an explicit vote/decision. This issue should be tightly scoped to the relevant decision only, and include the vote label.\n\nWhen an implementation of a decision appears in a pull request, link to the relevant vote issue.\n\nCouncils and those proposing decisions should explicitly distinguish between decisions that are two-way doors (easy to reverse later) and one-way doors (difficult or impossible to reverse later). For one-way doors, councils should carefully weigh alternatives and tradeoffs and take extra care to ensure broad participation and stakeholder input. For two-way doors, councils should feel free to move quickly, without compromising the principles and procedures described herein.","type":"content","url":"/decision-making#optional-aspects-of-decision-making","position":5},{"hierarchy":{"lvl1":"Decision-Making Guide","lvl2":"Language for issue/PR template"},"type":"lvl2","url":"/decision-making#language-for-issue-pr-template","position":6},{"hierarchy":{"lvl1":"Decision-Making Guide","lvl2":"Language for issue/PR template"},"content":"Project Jupyter councils make decisions using a consensus-seeking model. You can read about this model here (link). The council for this project is documented here (link).","type":"content","url":"/decision-making#language-for-issue-pr-template","position":7},{"hierarchy":{"lvl1":"Distinguished Contributors"},"type":"lvl1","url":"/distinguished-contributors","position":0},{"hierarchy":{"lvl1":"Distinguished Contributors"},"content":"The current Distinguished Contributors are listed \n\nhere.","type":"content","url":"/distinguished-contributors","position":1},{"hierarchy":{"lvl1":"Distinguished Contributors","lvl2":"Purpose"},"type":"lvl2","url":"/distinguished-contributors#purpose","position":2},{"hierarchy":{"lvl1":"Distinguished Contributors","lvl2":"Purpose"},"content":"This document describes the Distinguished Contributors body of the Jupyter Governance Model. Membership in the Distinguished Contributors is meant to recognize the work of community members that have gone above-and-beyond in their work on the project. It is not meant as a means of conveying power or responsibility. A public record of each Distinguished Contributor’s current biography and achievements will be maintained by the members themselves and will be displayed on the Jupyter website.","type":"content","url":"/distinguished-contributors#purpose","position":3},{"hierarchy":{"lvl1":"Distinguished Contributors","lvl2":"Rights of Distinguished Contributors"},"type":"lvl2","url":"/distinguished-contributors#rights-of-distinguished-contributors","position":4},{"hierarchy":{"lvl1":"Distinguished Contributors","lvl2":"Rights of Distinguished Contributors"},"content":"Distinguished Contributors have the right to elect new Distinguished Contributors. We recognize the knowledge and experience that Distinguished Contributors bring to the project. From time to time, the Executive Council and Software Steering Council may poll the group of Distinguished Contributors for their insights.","type":"content","url":"/distinguished-contributors#rights-of-distinguished-contributors","position":5},{"hierarchy":{"lvl1":"Distinguished Contributors","lvl2":"Distinguished Contributor membership"},"type":"lvl2","url":"/distinguished-contributors#distinguished-contributor-membership","position":6},{"hierarchy":{"lvl1":"Distinguished Contributors","lvl2":"Distinguished Contributor membership"},"content":"","type":"content","url":"/distinguished-contributors#distinguished-contributor-membership","position":7},{"hierarchy":{"lvl1":"Distinguished Contributors","lvl3":"Criteria for Nominating New Distinguished Contributors","lvl2":"Distinguished Contributor membership"},"type":"lvl3","url":"/distinguished-contributors#criteria-for-nominating-new-distinguished-contributors","position":8},{"hierarchy":{"lvl1":"Distinguished Contributors","lvl3":"Criteria for Nominating New Distinguished Contributors","lvl2":"Distinguished Contributor membership"},"content":"To be considered for nomination as a Distinguished Contributor a Project Contributor must have produced contributions to Jupyter itself that are substantial in quality and quantity, and sustained over at least two years. When considering potential Members, the existing Distinguished Contributors will look at nominees with a comprehensive view of their contributions. This will include but is not limited to code, code review, infrastructure work, mailing list and chat participation, community help/building, education and outreach, fundraising, branding, marketing, inclusion and diversity, UX design and research, etc. We are deliberately not setting arbitrary quantitative metrics (like “100 commits in this repo”) to avoid encouraging behavior that plays to the metrics rather than the project’s overall well-being.","type":"content","url":"/distinguished-contributors#criteria-for-nominating-new-distinguished-contributors","position":9},{"hierarchy":{"lvl1":"Distinguished Contributors","lvl3":"Term length","lvl2":"Distinguished Contributor membership"},"type":"lvl3","url":"/distinguished-contributors#term-length","position":10},{"hierarchy":{"lvl1":"Distinguished Contributors","lvl3":"Term length","lvl2":"Distinguished Contributor membership"},"content":"Membership in the Distinguished Contributors body is a lifetime appointment.","type":"content","url":"/distinguished-contributors#term-length","position":11},{"hierarchy":{"lvl1":"Distinguished Contributors","lvl3":"Selecting Distinguished Contributors Members","lvl2":"Distinguished Contributor membership"},"type":"lvl3","url":"/distinguished-contributors#selecting-distinguished-contributors-members","position":12},{"hierarchy":{"lvl1":"Distinguished Contributors","lvl3":"Selecting Distinguished Contributors Members","lvl2":"Distinguished Contributor membership"},"content":"Distinguished Contributors are added to this body on an annual basis, through a voting process carried out by the pre-existing body of Distinguished Contributors. The number of candidates chosen each year will be limited to 5 new members. Nominations for election can be submitted by any Distinguished Contributor to be reviewed by a committee of peer reviewers chosen from the Distinguished Contributors. This committee is responsible for managing the private voting process and reviewing nominees to ensure that they meet the minimum criteria for Distinguished Contributor status. After nominees are finalized, the Distinguished Contributors will vote in a ranked preference process.\n\nEach newly inducted member will be awarded a nominal purse of $500 per awardee, subject to budgetary constraints, in recognition for service to the community.","type":"content","url":"/distinguished-contributors#selecting-distinguished-contributors-members","position":13},{"hierarchy":{"lvl1":"Distinguished Contributors","lvl3":"Bootstrapping the Distinguished Contributors","lvl2":"Distinguished Contributor membership"},"type":"lvl3","url":"/distinguished-contributors#bootstrapping-the-distinguished-contributors","position":14},{"hierarchy":{"lvl1":"Distinguished Contributors","lvl3":"Bootstrapping the Distinguished Contributors","lvl2":"Distinguished Contributor membership"},"content":"The inaugural members of the Distinguished Contributors will be the members of the original Jupyter Steering Council. There will be no monetary award for these bootstrap year inductions. Within the first 3 months of its existence, the DCs will run a special election to address the backlog of potential DCs. This special election will be limited to 20 additional members.","type":"content","url":"/distinguished-contributors#bootstrapping-the-distinguished-contributors","position":15},{"hierarchy":{"lvl1":"Executive Council"},"type":"lvl1","url":"/executive-council","position":0},{"hierarchy":{"lvl1":"Executive Council"},"content":"The current members of the Executive Council are listed in the \n\nLeadership Directory.\n\nClick here for the team compass. 🧭\n\nThe Executive Council Team Compass is at ec.jupyter.org. It has more information about operations, meetings, e-mail and contact info, etc.\nThis page focuses on the governance aspects of the Executive Council.","type":"content","url":"/executive-council","position":1},{"hierarchy":{"lvl1":"Executive Council","lvl2":"Purpose"},"type":"lvl2","url":"/executive-council#purpose","position":2},{"hierarchy":{"lvl1":"Executive Council","lvl2":"Purpose"},"content":"The Executive Council (EC) is ultimately responsible for all dimensions of the Project (including, but not limited to, software, legal, financial, community, operations, inclusion and diversity, etc.). The members of the EC actively work to carry out the Project’s mission in accordance with its values and to support operations through delegation to the Software Steering Council (SSC), Software Subprojects, Standing Committees, and Working Groups. These other bodies will report to the EC, and the EC is expected to support, oversee, manage, and ensure the success of operations across Jupyter.","type":"content","url":"/executive-council#purpose","position":3},{"hierarchy":{"lvl1":"Executive Council","lvl2":"Responsibilities"},"type":"lvl2","url":"/executive-council#responsibilities","position":4},{"hierarchy":{"lvl1":"Executive Council","lvl2":"Responsibilities"},"content":"","type":"content","url":"/executive-council#responsibilities","position":5},{"hierarchy":{"lvl1":"Executive Council","lvl3":"Sole responsibilities","lvl2":"Responsibilities"},"type":"lvl3","url":"/executive-council#sole-responsibilities","position":6},{"hierarchy":{"lvl1":"Executive Council","lvl3":"Sole responsibilities","lvl2":"Responsibilities"},"content":"The EC has the responsibility to:\n\nEstablish, dissolve, support, and manage \n\nWorking Groups.\n\nNominate particular Working Groups to have a representative on the SSC.\n\nSupport and manage \n\nStanding Committees.\n\nActively work to increase and promote diversity, equity, and inclusion across the Project and its leadership bodies.\n\nMaintain and implement the \n\nJupyter Code of Conduct and incident response process.\n\nServe as the body of appeal for incident decisions made by the Code of Conduct Standing Committee.\n\nRaise, allocate, and manage all Project funding and sponsorships, and set policies and procedures for third parties to request external funding with the official endorsement of Project Jupyter.\n\nAllocate resources, select candidates, define scope and priorities, and manage roles and personnel employed to conduct business operations on behalf of Project Jupyter.\n\nManage legal aspects of the Project, such as copyright, contracts, compliance, and licensing.\n\nManage the Jupyter brand, including the Project-wide website, core design philosophy, design assets, trademarks, and naming.\n\nManage public communications and community activities, including social media, conferences, workshops, and community-wide resources.\n\nManage any Jupyter services, including hosted services such as nbviewer, \n\njupyter.org, and \n\nmybinder.org.\n\nManage the Project’s relationship with \n\nLF Charities, which is Project Jupyter’s parent nonprofit organization and legal entity. This includes ensuring the Project follows the applicable LF Charities policies.\n\nManage the Project’s relationship with the \n\nLinux Foundation, which holds assets in custody for Project Jupyter.\n\nManage the Project’s relationship with the \n\nJupyter Foundation, including serving on the Jupyter Foundation Governing Board.\n\nWrite an annual stakeholders letter to provide a summary of the previous year’s activities across the community and to highlight the current and future direction of the Project.\n\nMentor potential future EC members. The EC is expected to identify potential future members of the EC and proactively mentor those individuals.\n\nMaintain Project-wide documentation and information to enable users to discover and navigate the resources of the Project.\n\nThe EC can override decisions of the SSC, Software Subprojects, Standing Committees, and Working Groups in exceptional situations as the Project’s final decision-maker. The EC cannot override SSC decisions that are shared responsibilities, as listed below.","type":"content","url":"/executive-council#sole-responsibilities","position":7},{"hierarchy":{"lvl1":"Executive Council","lvl3":"Shared responsibilities with the Software Steering Council","lvl2":"Responsibilities"},"type":"lvl3","url":"/executive-council#shared-responsibilities-with-the-software-steering-council","position":8},{"hierarchy":{"lvl1":"Executive Council","lvl3":"Shared responsibilities with the Software Steering Council","lvl2":"Responsibilities"},"content":"The EC and SSC share responsibility for approving:\n\nChanges to the Jupyter Governance model.\n\nCreation of new Jupyter Subprojects.\n\nRemoval of Subprojects from Jupyter.\n\nIn these decisions, each body will \n\nvote independently and the change will be approved only if both bodies approve.","type":"content","url":"/executive-council#shared-responsibilities-with-the-software-steering-council","position":9},{"hierarchy":{"lvl1":"Executive Council","lvl3":"Team Compass","lvl2":"Responsibilities"},"type":"lvl3","url":"/executive-council#team-compass","position":10},{"hierarchy":{"lvl1":"Executive Council","lvl3":"Team Compass","lvl2":"Responsibilities"},"content":"The \n\nExecutive Council Team Compass is at \n\nec.jupyter.org. It publishes information about the activities and operations of the EC, including how to contact the EC.","type":"content","url":"/executive-council#team-compass","position":11},{"hierarchy":{"lvl1":"Executive Council","lvl2":"Council membership and elections"},"type":"lvl2","url":"/executive-council#council-membership-and-elections","position":12},{"hierarchy":{"lvl1":"Executive Council","lvl2":"Council membership and elections"},"content":"The EC consists of 6 Council members.","type":"content","url":"/executive-council#council-membership-and-elections","position":13},{"hierarchy":{"lvl1":"Executive Council","lvl3":"How long are term lengths and limits?","lvl2":"Council membership and elections"},"type":"lvl3","url":"/executive-council#term-limits","position":14},{"hierarchy":{"lvl1":"Executive Council","lvl3":"How long are term lengths and limits?","lvl2":"Council membership and elections"},"content":"Each EC member is elected to a 2-year term.\n\nEC members can serve consecutive terms if they are re-elected.\n\nEC members cannot begin a new term if they have served on the EC for 3 of the last 4 years.","type":"content","url":"/executive-council#term-limits","position":15},{"hierarchy":{"lvl1":"Executive Council","lvl3":"Who elects the Executive Council?","lvl2":"Council membership and elections"},"type":"lvl3","url":"/executive-council#ec-electors","position":16},{"hierarchy":{"lvl1":"Executive Council","lvl3":"Who elects the Executive Council?","lvl2":"Council membership and elections"},"content":"There are two types of seats on the Executive Council. Those chosen by individuals throughout the Jupyter Community (see below), and those chosen by the current members of the Executive Council.\n\nAfter each election, the cumulative total number of seats filled by the UoC must be equal to, or one more than, the number filled by the EC.\n\nFor seats elected by the UoC, any member of the \n\nUnion of Councils has one vote.","type":"content","url":"/executive-council#ec-electors","position":17},{"hierarchy":{"lvl1":"Executive Council","lvl3":"Who is elegible for serving on the Executive Council?","lvl2":"Council membership and elections"},"type":"lvl3","url":"/executive-council#who-is-elegible-for-serving-on-the-executive-council","position":18},{"hierarchy":{"lvl1":"Executive Council","lvl3":"Who is elegible for serving on the Executive Council?","lvl2":"Council membership and elections"},"content":"Any UoC member is eligible for candidacy in an election to the EC provided that they are a valid candidate for serving a new term (e.g., doing so would not violate the EC \n\nTerm Limits).\n\nA person may not serve simultaneously on the EC and SSC.","type":"content","url":"/executive-council#who-is-elegible-for-serving-on-the-executive-council","position":19},{"hierarchy":{"lvl1":"Executive Council","lvl3":"How does the nomination and election process work?","lvl2":"Council membership and elections"},"type":"lvl3","url":"/executive-council#how-does-the-nomination-and-election-process-work","position":20},{"hierarchy":{"lvl1":"Executive Council","lvl3":"How does the nomination and election process work?","lvl2":"Council membership and elections"},"content":"Each annual election will begin with the existing EC notifying the UoC of a call for nominations. Any member of the UoC may nominate a candidate, including themselves. The EC will confirm that a nominee is eligible and accepts their nomination. The candidate shall write a statement of their interest, qualifications, experience, etc., that will be distributed to voters. Once the full set of candidates is assembled, the UoC and then the EC will take ranked choice votes to fill their allocated number of EC seats.","type":"content","url":"/executive-council#how-does-the-nomination-and-election-process-work","position":21},{"hierarchy":{"lvl1":"Executive Council","lvl3":"What if somebody leaves their seat during a term?","lvl2":"Council membership and elections"},"type":"lvl3","url":"/executive-council#what-if-somebody-leaves-their-seat-during-a-term","position":22},{"hierarchy":{"lvl1":"Executive Council","lvl3":"What if somebody leaves their seat during a term?","lvl2":"Council membership and elections"},"content":"If a member leaves the council before the end of their term, the EC may designate an eligible replacement who will serve for the rest of the term. This replacement will count as a seat filled by the EC if the replacement serves more than half of the term.","type":"content","url":"/executive-council#what-if-somebody-leaves-their-seat-during-a-term","position":23},{"hierarchy":{"lvl1":"Executive Council","lvl3":"How can an EC member be removed?","lvl2":"Council membership and elections"},"type":"lvl3","url":"/executive-council#how-can-an-ec-member-be-removed","position":24},{"hierarchy":{"lvl1":"Executive Council","lvl3":"How can an EC member be removed?","lvl2":"Council membership and elections"},"content":"The EC may vote to remove an EC member. A removal motion passes if two-thirds of the entire EC votes in favor of removal. All EC members are expected to vote without recusal, including the member in question.","type":"content","url":"/executive-council#how-can-an-ec-member-be-removed","position":25},{"hierarchy":{"lvl1":"Executive Council","lvl3":"The Union of Councils","lvl2":"Council membership and elections"},"type":"lvl3","url":"/executive-council#union-of-councils","position":26},{"hierarchy":{"lvl1":"Executive Council","lvl3":"The Union of Councils","lvl2":"Council membership and elections"},"content":"The Union of Councils (UoC) is the union of the membership of these groups:\n\nAll \n\nSubproject Councils\n\nAll \n\nStanding Committees\n\nAll \n\nWorking Groups\n\nIt makes up the voting body that \n\nelects members of the Executive Council.","type":"content","url":"/executive-council#union-of-councils","position":27},{"hierarchy":{"lvl1":"Executive Council","lvl2":"Bootstrapping the Executive Council"},"type":"lvl2","url":"/executive-council#bootstrapping-the-executive-council","position":28},{"hierarchy":{"lvl1":"Executive Council","lvl2":"Bootstrapping the Executive Council"},"content":"The process to create the initial Executive Council is \n\ndescribed in this document.","type":"content","url":"/executive-council#bootstrapping-the-executive-council","position":29},{"hierarchy":{"lvl1":"Project Jupyter Governance"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Project Jupyter Governance"},"content":"This documentation formalizes the governance process of\nProject Jupyter. The governing bodies of Project Jupyter are described, a code of conduct is established, and other organizational policies are outlined.","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Project Jupyter Governance","lvl2":"License of Governance Documents"},"type":"lvl2","url":"/#license-of-governance-documents","position":2},{"hierarchy":{"lvl1":"Project Jupyter Governance","lvl2":"License of Governance Documents"},"content":"To the extent possible under law, Project Jupyter has waived all copyright and related or neighboring rights to the Project Jupyter Governance documents, in accordance with the Creative Commons \n\nCC0 license. This work is published from the United States.  See the \n\nLICENSE.md file\nin this repository for details.","type":"content","url":"/#license-of-governance-documents","position":3},{"hierarchy":{"lvl1":"Jupyter Foundation"},"type":"lvl1","url":"/jupyter-foundation","position":0},{"hierarchy":{"lvl1":"Jupyter Foundation"},"content":"The Jupyter Foundation is a directed fund of the Linux Foundation 501(c)(6) whose purpose is to raise, budget and spend funds in support of Project Jupyter and its mission. A draft of the Jupyter Foundation charter is linked \n\nbelow. A brief summary of relevant points from the charter is provided in this document.","type":"content","url":"/jupyter-foundation","position":1},{"hierarchy":{"lvl1":"Jupyter Foundation","lvl2":"Jupyter Foundation Charter"},"type":"lvl2","url":"/jupyter-foundation#jupyter-foundation-charter","position":2},{"hierarchy":{"lvl1":"Jupyter Foundation","lvl2":"Jupyter Foundation Charter"},"content":"The \n\nJupyter Foundation charter defines the Jupyter Foundation’s structure and relationship to its members.","type":"content","url":"/jupyter-foundation#jupyter-foundation-charter","position":3},{"hierarchy":{"lvl1":"Jupyter Foundation","lvl2":"Jupyter Foundation Governing Board"},"type":"lvl2","url":"/jupyter-foundation#jupyter-foundation-governing-board","position":4},{"hierarchy":{"lvl1":"Jupyter Foundation","lvl2":"Jupyter Foundation Governing Board"},"content":"The Jupyter Foundation Governing Board controls the resources of the Jupyter Foundation and works to build a healthy collaboration between the Jupyter community, Jupyter leadership, and members of the Jupyter Foundation, including for-profit organizations. The current members of the Jupyter Foundation Governing Board are listed in the \n\nLeadership Directory.","type":"content","url":"/jupyter-foundation#jupyter-foundation-governing-board","position":5},{"hierarchy":{"lvl1":"Jupyter Foundation","lvl2":"Location of the Board’s team compass"},"type":"lvl2","url":"/jupyter-foundation#location-of-the-boards-team-compass","position":6},{"hierarchy":{"lvl1":"Jupyter Foundation","lvl2":"Location of the Board’s team compass"},"content":"Jupyter Foundation Board team compass","type":"content","url":"/jupyter-foundation#location-of-the-boards-team-compass","position":7},{"hierarchy":{"lvl1":"Jupyter Foundation","lvl2":"Responsibilities of the Jupyter Foundation Governing Board"},"type":"lvl2","url":"/jupyter-foundation#responsibilities-of-the-jupyter-foundation-governing-board","position":8},{"hierarchy":{"lvl1":"Jupyter Foundation","lvl2":"Responsibilities of the Jupyter Foundation Governing Board"},"content":"Support Project Jupyter and its mission.\n\nOverall management of the Jupyter Foundation.\n\nApprove an annual budget directing the use of Jupyter Foundation funds.\n\nApprove changes to the Jupyter Foundation charter.","type":"content","url":"/jupyter-foundation#responsibilities-of-the-jupyter-foundation-governing-board","position":9},{"hierarchy":{"lvl1":"Jupyter Foundation","lvl2":"Membership"},"type":"lvl2","url":"/jupyter-foundation#membership","position":10},{"hierarchy":{"lvl1":"Jupyter Foundation","lvl2":"Membership"},"content":"The Jupyter Foundation Governing Board consists of:\n\nAll members of the \n\nJupyter Executive Council.\n\nOne representative from each Jupyter Foundation Premier Member.\n\nBetween one and three representatives total from all Jupyter Foundation General Members.","type":"content","url":"/jupyter-foundation#membership","position":11},{"hierarchy":{"lvl1":"Jupyter Foundation","lvl2":"Decision making"},"type":"lvl2","url":"/jupyter-foundation#decision-making","position":12},{"hierarchy":{"lvl1":"Jupyter Foundation","lvl2":"Decision making"},"content":"The Jupyter Foundation Governing Board follows the decision-making policies in the \n\nJupyter Foundation charter.","type":"content","url":"/jupyter-foundation#decision-making","position":13},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth"},"type":"lvl1","url":"/linux-proposal","position":0},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth"},"content":"March 5, 2024\n\nDiscussion of this proposal is at \n\njupyter​/governance​#204. You can also \n\ncontact the EC in the EC office hours or by private email to share your thoughts.","type":"content","url":"/linux-proposal","position":1},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl2":"Executive Summary"},"type":"lvl2","url":"/linux-proposal#executive-summary","position":2},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl2":"Executive Summary"},"content":"The Jupyter Executive Council (EC) has the responsibility to ensure the\nhealthy and sustainable evolution of Project Jupyter and to seek the\nbest vehicles to support this. We, the EC, propose to create a new\nfunding vehicle for the project, paired with some management and\noperational changes in support of this funding mechanism, in partnership\nwith the Linux Foundation (LF). These changes will enable us to grow\nand develop ambitious efforts we have often discussed but lacked\nresources to implement, and provide long-term stability both for key\nJupyter contributors and the project itself. While Project Jupyter has\nbeen impactful and successful in many areas, we currently struggle in\nour ability to scale in certain strategic directions and in maintaining\ncore functions needed for an effort of our size and scope. We believe\nthe plan below is the right path forward to meet these challenges;\nwe’ve come to this plan after a detailed exploration of multiple\noptions.\n\nWe propose that Project Jupyter -- with its current governance\nstructure, name, and trademarks -- transfer from NumFOCUS to the Linux Foundation\nCharities 501(c)(3). This transition would be paired with the creation\nof a new resource, provisionally called the Jupyter Foundation,\ndesignated to secure corporate contributions, and an associated\ncommittee to make budgetary decisions associated with these funds. The\nJupyter Foundation would be under the Linux Foundation 501(c)(6).\nBelow, we provide more details about this proposal and answer questions.\nThis document aims to be a reference point for the community to discuss\nthis plan, which (after suitable community deliberation, refinement, and\napproval) the EC would like to implement as soon as possible.\n\nNote -- A 501(c)(3) and 501(c)(6) are both tax-exempt nonprofit\nstructures in the United States. A (c)(3) is a vehicle to support\ncollective fundraising for a scientific or charitable purpose. A\n(c)(6) is a vehicle to support collective fundraising for a common\nbusiness interest in industry. Like many projects that the LF hosts,\nProject Jupyter aligns both with nonprofit models with scientific and\neducational goals, and with business interests. Therefore, it can take\nadvantage of having both fundraising options available to donors\nthrough LF Charities, a 501(c)(3), and the Linux Foundation, a\n501(c)(6).","type":"content","url":"/linux-proposal#executive-summary","position":3},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl2":"Project Jupyter’s Needs"},"type":"lvl2","url":"/linux-proposal#project-jupyters-needs","position":4},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl2":"Project Jupyter’s Needs"},"content":"Project Jupyter requires sustainable funding that is centrally managed\nfor some key “backbone needs” of the project. There are activities\nand programs that are critical to the mission of Jupyter that are\ncurrently either underfunded or unfunded. Examples include JupyterCon,\nother Jupyter community and outreach events, Binder, NbViewer,\n\n\njupyter.org, an Executive Director, other project-wide staff (release\nengineering, developer advocate, documentation writer, program manager,\ntesting infrastructure, etc.), and more. We believe that if a few such\n“backbone” roles and activities are sustainably funded, it will become\neasier for individual subprojects and teams in the community to pursue\nstrategic objectives, propose new developments, and seek targeted\nresources that rely on this stable foundation for coordination,\nplanning, and project-wide interactions. The EC has a goal to raise\n$1-2 million/year in a sustainable manner.\n\nThe EC believes that this funding can come from a combination of\nnon-profit (private foundations, government grants) and for-profit\n(corporate) sources. In the past, Jupyter has obtained grants on the\norder of a million dollars and above through private foundations, with\nsmaller contributions coming from individuals and a few generous\ncorporate partners. Securing consistent funding via grants has proven\nchallenging given the lumpy nature of grant allocations and the limited\nnumber of people who can devote their time to grant writing for Jupyter.\nThese inconsistent levels of funding make it very difficult to maintain\na stable backbone for the project that enables long-term vision and\nstrategic planning and execution. Similarly, we have faced challenges in\nraising consistent funding from corporations.\n\nAdditionally, Jupyter needs improved operational support. Jupyter\nneeds a higher level of support for operating (legal/trademark,\nmarketing, fundraising, accounting, contracts, internships, events, dev\nops, etc.) than is currently available from NumFOCUS. The EC’s\nresponsibility is to serve Jupyter’s pressing needs today and tomorrow;\ncurrently, the EC is spending a significant amount of its time on\noperational matters instead of fundraising and other activities that\nsupport Jupyter’s long-term mission. At this time, and after extensive\nconversations with NumFOCUS and time spent by Ana Ruvalcaba taking deep\ndives into operational matters, the EC’s assessment is that the best\ncourse of action is to secure operational support with a proven partner\nthat can provide it today. Our assessment is that the Linux Foundation\nis such an ideal partner for Jupyter today.\n\nFinally, Jupyter needs to be able to hire and manage full-time\nstaff, including roles such as an Executive Director, CI/devops,\nprogram managers, test engineering, documentation writing, and release\nengineering. These require a sustained and full-time effort, beyond what\nis reasonable for volunteers or can be funded via project-specific\ninitiatives and/or grants. In the past, we have funded, hired, and\nmanaged these types of roles through universities (Cal Poly State\nUniversity, San Luis Obispo and UC Berkeley), but that is not\nsustainable for the institution or the staff who seek a long term career\npath associated with Jupyter, rather than with specific corporate or\nacademic organizations. Again, Jupyter needs sustainable funding and\noperational support to hire, retain, and manage contributors in these\ntypes of roles.","type":"content","url":"/linux-proposal#project-jupyters-needs","position":5},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl2":"So, what would be changing?"},"type":"lvl2","url":"/linux-proposal#so-what-would-be-changing","position":6},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl2":"So, what would be changing?"},"content":"We have spent time and effort in discussions with the Linux Foundation\nteam, to ensure that this transition introduces the smallest possible\nchanges to Jupyter’s operations while meeting our above goals.\n\nUnder this proposal, Jupyter keeps its current governance structure\nand transfers from NumFOCUS to LF Charities 501(c)(3). An additional\nfunding vehicle will be created called the Jupyter Foundation under the\nLinux Foundation 501(c)(6) providing corporations a well-known and\nproven method to support the Jupyter Project.\n\nIn order to manage this new resource (the Jupyter Foundation), we\npropose to create a new committee (JFC), populated by representatives of\nour corporate funders. The role of this committee will be to approve the\nuse of the corporate funding available, in coordination with the EC. The\nJFC and EC members will vote on Jupyter Foundation resource allocation\nwith exact details to be determined soon (for example, the funding\ncommittee model typically has one vote per corporate funding\nrepresentative).\n\nAs part of the normal course of business, and to encourage strategic\nengagement of the corporate partners (beyond just giving money), the EC\nmeetings will be open to members of the JFC, though the EC reserves the\nright to call a separate closed meeting should the need arise.\n\nIn addition, the Linux Foundation through its 501(c)(3) and 501(c)(6)\nwill provide back-office operational support as needed for the project\noperations such as grants and events as well as the ability to hire\nstaff for the benefit of the project.","type":"content","url":"/linux-proposal#so-what-would-be-changing","position":7},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl2":"What other options have we explored?"},"type":"lvl2","url":"/linux-proposal#what-other-options-have-we-explored","position":8},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl2":"What other options have we explored?"},"content":"We have investigated the following options:\n\nRemaining at NumFOCUS\n\nJoining several other 501(c)(3) organizations.\n\nPartnering with Linux Foundation via its 501(c)(3) and 501(c)(6)\nsupport structures (our proposed path)\n\nCreating our own 501(c)(3).\n\nNumFocus, as previously stated, is not able to meet our needs and our\ngoals for Project Jupyter at this time.\n\nOther 501(c)(3) organizations were either larger in scale, but without\ndeep experience supporting open source projects and their communities,\nor smaller in scale but with experience supporting software projects.\n\nThe costs to instantiate and operate a new 501(c)(3) are very high and\nthe focus on building up back-office infrastructure expertise and\ncapabilities would limit our ability to focus on the needs stated\nearlier.\n\nAfter carefully evaluating all these options and engaging in multiple\ndetailed discussions, we concluded that the Linux Foundation is the best\noption. LF can support our existing community and governance structure,\nand it has a proven track record of supporting software projects with a\nsustainable operational and multi-modal funding model that scales.","type":"content","url":"/linux-proposal#what-other-options-have-we-explored","position":9},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl2":"How does this affect our project’s mission regarding both open science, education, and access to all regardless of money or industrial relationships?"},"type":"lvl2","url":"/linux-proposal#how-does-this-affect-our-projects-mission-regarding-both-open-science-education-and-access-to-all-regardless-of-money-or-industrial-relationships","position":10},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl2":"How does this affect our project’s mission regarding both open science, education, and access to all regardless of money or industrial relationships?"},"content":"Project Jupyter’s mission and focus on open science remains unchanged\nand driven by its contributors. Project Jupyter will develop a formal\nmission statement that will reiterate our commitment to open science,\neducation, research and broad access to interactive computing. Based on\nmany previous discussions we’ve had on this topic, we propose here a\nrough draft of such a mission statement: “Project Jupyter is an open and\ncollaborative community that develops interactive computing tools,\nsoftware, standards, and infrastructure for research, education, and\nindustry.” As part of the transition to LF, we will open an issue to\ndiscuss and approve an official mission statement.","type":"content","url":"/linux-proposal#how-does-this-affect-our-projects-mission-regarding-both-open-science-education-and-access-to-all-regardless-of-money-or-industrial-relationships","position":11},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl2":"Other Questions (FAQ)"},"type":"lvl2","url":"/linux-proposal#other-questions-faq","position":12},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl2":"Other Questions (FAQ)"},"content":"","type":"content","url":"/linux-proposal#other-questions-faq","position":13},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"What is the proposed timeline?","lvl2":"Other Questions (FAQ)"},"type":"lvl3","url":"/linux-proposal#what-is-the-proposed-timeline","position":14},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"What is the proposed timeline?","lvl2":"Other Questions (FAQ)"},"content":"The EC anticipates community discussion in March 2024 leads to a formal\ngovernance change proposal in April 2024 to move from NumFOCUS to LF\nCharities 501(c)(3), creation of an LF 501(c)(6) foundation, and the\noperational details of how these entities will be managed (e.g.,\ncreation of a budget process). The EC anticipates this proposal will be\nvoted on by the newly-elected EC and SSC by the end of April 2024. If\napproved, the EC anticipates that the effective date of a move to LF\ncould be 60 days later, by the end of June 2024.","type":"content","url":"/linux-proposal#what-is-the-proposed-timeline","position":15},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"How would the 501(c)(3) and 501(c)(6) legal entities work together for Project Jupyter?","lvl2":"Other Questions (FAQ)"},"type":"lvl3","url":"/linux-proposal#how-would-the-501-c-3-and-501-c-6-legal-entities-work-together-for-project-jupyter","position":16},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"How would the 501(c)(3) and 501(c)(6) legal entities work together for Project Jupyter?","lvl2":"Other Questions (FAQ)"},"content":"The Project Jupyter EC continues its current authority over funds and\ngrants that go to the 501(c)(3). As explained above, the corporate\nfunders to the Jupyter Foundation would have input, along with the\nProject Jupyter EC, into how Jupyter Foundation funds are allocated for\nthe sustainability and growth of Project Jupyter.","type":"content","url":"/linux-proposal#how-would-the-501-c-3-and-501-c-6-legal-entities-work-together-for-project-jupyter","position":17},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"What Jupyter assets would be maintained by the 501(c)(3) LF Charities?","lvl2":"Other Questions (FAQ)"},"type":"lvl3","url":"/linux-proposal#what-jupyter-assets-would-be-maintained-by-the-501-c-3-lf-charities","position":18},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"What Jupyter assets would be maintained by the 501(c)(3) LF Charities?","lvl2":"Other Questions (FAQ)"},"content":"Project trademarks, domain name registrations, and GitHub account access for\nProject Jupyter GitHub organizations will be maintained by the 501(c)(3) LF\nCharities. Additionally, any 501(c)(3) contributions to Project Jupyter will be\nmaintained by LF Charities and controlled by the Project Jupyter EC.","type":"content","url":"/linux-proposal#what-jupyter-assets-would-be-maintained-by-the-501-c-3-lf-charities","position":19},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"How would this move to LF change our relationship with NumFOCUS?","lvl2":"Other Questions (FAQ)"},"type":"lvl3","url":"/linux-proposal#how-would-this-move-to-lf-change-our-relationship-with-numfocus","position":20},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"How would this move to LF change our relationship with NumFOCUS?","lvl2":"Other Questions (FAQ)"},"content":"Once the transition is concluded and assets (such as trademarks) are transferred, Project\nJupyter would not have a legal relationship with NumFOCUS. However, we\nwill always maintain a collaborative relationship with NumFOCUS and its\nvarious projects: Jupyter is for many a portal into a broad ecosystem of\nprojects that currently operate under NumFOCUS, and we’ll continue\ncollaborating with all of them as before. In this regard, NumFOCUS is\nand would remain a key partner for Project Jupyter, and we wish the\nNumFOCUS team success.\n\nWe will work out a transition plan between NF and the LF Charities that\nwill minimize disruption to the projects. For exampe, there may be some funds that\nare simpler to wind down through NF and some that are easier to move to\nthe LF Charities.","type":"content","url":"/linux-proposal#how-would-this-move-to-lf-change-our-relationship-with-numfocus","position":21},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"What is the process for Jupyter leaving NumFOCUS and whose authority/approvals does it require?","lvl2":"Other Questions (FAQ)"},"type":"lvl3","url":"/linux-proposal#what-is-the-process-for-jupyter-leaving-numfocus-and-whose-authority-approvals-does-it-require","position":22},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"What is the process for Jupyter leaving NumFOCUS and whose authority/approvals does it require?","lvl2":"Other Questions (FAQ)"},"content":"Jupyter’s current governance model requires any \n\nchanges to Jupyter’s governance\nto be approved by the Jupyter Executive Council and Software\nSteering Council. Once these two bodies have voted to leave NumFOCUS and\ntransfer the project to LF Charities 501(c)(3), the NumFOCUS FSA\nCommittee will formally notify NumFOCUS of our plans. The current FSA\nrequires us to give NumFOCUS a 60-day notice before moving. The NumFOCUS\nFSA Committee currently consists of Matthias Bussonnier, Benjamin\nRagan-Kelley, Fernando Pérez, Ana Ruvalcaba, and Thomas Kluyver.","type":"content","url":"/linux-proposal#what-is-the-process-for-jupyter-leaving-numfocus-and-whose-authority-approvals-does-it-require","position":23},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"What will be the process for Jupyter potentially leaving the Linux Foundation in the future?","lvl2":"Other Questions (FAQ)"},"type":"lvl3","url":"/linux-proposal#what-will-be-the-process-for-jupyter-potentially-leaving-the-linux-foundation-in-the-future","position":24},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"What will be the process for Jupyter potentially leaving the Linux Foundation in the future?","lvl2":"Other Questions (FAQ)"},"content":"When requested by the governing body for a project, the LF has moved\nprojects out of its stewardship to the governing body’s designated\nentity. In our case, this would be considered a \n\ngovernance change\nthat requires approval from the EC and SSC. The Project Jupyter\nassets in the 501(c)(3) would transfer to another 501(c)(3) and\n501(c)(6) assets could be transferred to another 501(c)(6) or to the\n501(c)(3), in accordance with tax rules and subject to grant agreements\nthen in effect. Similarly, there will be a notice period, and wind-down\ncomponent related to employees, IP, etc.","type":"content","url":"/linux-proposal#what-will-be-the-process-for-jupyter-potentially-leaving-the-linux-foundation-in-the-future","position":25},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"What happens to our IP if LF Charities dissolves?","lvl2":"Other Questions (FAQ)"},"type":"lvl3","url":"/linux-proposal#what-happens-to-our-ip-if-lf-charities-dissolves","position":26},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"What happens to our IP if LF Charities dissolves?","lvl2":"Other Questions (FAQ)"},"content":"Upon dissolution of any entity (LF Charities, NumFOCUS, etc), the entity would\nhave to either transfer assets or identify the entity taking them over.\nHypothetically, in a dissolution scenario, LF Charities would have to plan out\nthe path with the project governing body to see where the LF Charity project\nassets would go. There may be complications or other factors depending on the\nreason for any dissolution (e.g. bankruptcy). To be clear, there are no plans to\ndissolve LF Charities.","type":"content","url":"/linux-proposal#what-happens-to-our-ip-if-lf-charities-dissolves","position":27},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"How does corporate membership work in terms of levels and dues amount?","lvl2":"Other Questions (FAQ)"},"type":"lvl3","url":"/linux-proposal#how-does-corporate-membership-work-in-terms-of-levels-and-dues-amount","position":28},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"How does corporate membership work in terms of levels and dues amount?","lvl2":"Other Questions (FAQ)"},"content":"The details need to be finalized and we welcome input from the community\non this. Based on what is common with other funds under the Linux\nFoundation 501(c)(6), typically there are 2 levels, Premier and General.\nFor example, Premier members each get a seat on the funding committee\nand General members collectively have one elected representative from\nthe general member class that represents them alongside the Premier\nmembers. The dues amount will be determined based on the financial needs\nof Project Jupyter and corresponding alignment with corporate budgets\nthat have a precedent for supporting critical projects upon which\ncompanies depend. The Linux Foundation also has (free) Associate\nmemberships for government, education, research, and non-profit\norganizations. Given the importance of these types of organizations to\nthe mission of Jupyter, the EC would like to work through how they can\nbe included.","type":"content","url":"/linux-proposal#how-does-corporate-membership-work-in-terms-of-levels-and-dues-amount","position":29},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"Did we consider the Apache Software Foundation (ASF)?","lvl2":"Other Questions (FAQ)"},"type":"lvl3","url":"/linux-proposal#did-we-consider-the-apache-software-foundation-asf","position":30},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"Did we consider the Apache Software Foundation (ASF)?","lvl2":"Other Questions (FAQ)"},"content":"Yes. In our due diligence process, we considered several potential homes for\nJupyter. Specifically regarding ASF, moving to Apache would entail changing our\nsoftware license (to Apache), changing our project name to be \n\nprefixed with\n“Apache”, and drastically changing\nour project governance and communication channels. We saw these disruptions to\nthe community as too extreme compared to the benefits it would provide.","type":"content","url":"/linux-proposal#did-we-consider-the-apache-software-foundation-asf","position":31},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"Is this a major change to Project Jupyter’s governance?","lvl2":"Other Questions (FAQ)"},"type":"lvl3","url":"/linux-proposal#is-this-a-major-change-to-project-jupyters-governance","position":32},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"Is this a major change to Project Jupyter’s governance?","lvl2":"Other Questions (FAQ)"},"content":"No. The control of the Project will remain with the same bodies (EC and SSC)\nthat have control under the umbrella of NumFocus when and if we move to the\nLinux Foundation. There will be a new standing committee created to handle\ncorporate fundraising for the benefit of Project Jupyter. This committee will be\ntasked with raising funds and budgeting the funds they raise in close\ncollaboration with the Project’s leadership (EC).","type":"content","url":"/linux-proposal#is-this-a-major-change-to-project-jupyters-governance","position":33},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"What measures will the EC take to ensure that Jupyter has a level playing field for participation that is not skewed by the financial resources of its players?","lvl2":"Other Questions (FAQ)"},"type":"lvl3","url":"/linux-proposal#what-measures-will-the-ec-take-to-ensure-that-jupyter-has-a-level-playing-field-for-participation-that-is-not-skewed-by-the-financial-resources-of-its-players","position":34},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"What measures will the EC take to ensure that Jupyter has a level playing field for participation that is not skewed by the financial resources of its players?","lvl2":"Other Questions (FAQ)"},"content":"The decision-making authority of Project Jupyter is vested in the voting bodies\nof our governance model. This does not change when we change fiscal sponsors.\nThe primary authority that we are granting to players with substantial financial\nresources is to have a vote in how the funds they donate will be spent for the\nbenefit of Project Jupyter and the goals that are set by the EC and the SSC. To\nensure this, our agreement with the Linux Foundation will be to explicitly leave\nintact our current governance model as it is.","type":"content","url":"/linux-proposal#what-measures-will-the-ec-take-to-ensure-that-jupyter-has-a-level-playing-field-for-participation-that-is-not-skewed-by-the-financial-resources-of-its-players","position":35},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"How will a transition to LF affect grant funding that community members may seek?","lvl2":"Other Questions (FAQ)"},"type":"lvl3","url":"/linux-proposal#how-will-a-transition-to-lf-affect-grant-funding-that-community-members-may-seek","position":36},{"hierarchy":{"lvl1":"Proposal for Jupyter’s Sustainable Growth","lvl3":"How will a transition to LF affect grant funding that community members may seek?","lvl2":"Other Questions (FAQ)"},"content":"The EC believes that the Jupyter community needs a diverse set of funding\nmechanisms to be sustainable and scale. In the past, grant funding that\nbenefited Jupyter has included academic grants managed directly by universities,\ngrants from private foundations that flowed through Jupyter’s 501(c)(3) fiscal\nsponsor, and grants managed through other entities and foundations. We expect\nthat these sorts of funding arrangements will continue to be possible under the\nLF umbrella, with community members able to seek grant funding themselves for\nJupyter’s benefit. We expect the central roles that we hire, such as an\nexecutive director, program manager, etc., will be active in raising central\n“backbone” funding for Jupyter and will help in the strategic coordination of\ncommunity members  seeking additional funding.\n\nThe Linux Foundation and LF Charities have both received and managed\ngrant-making programs. Under the LF umbrella, if you are writing a grant and\ndesire the grant funding to flow through the LF Charities Jupyter 501(c)(3)\naccount, we will have a process to approve the request. The LF staff would work\nwith you on the budget for the grant and any other details for the transaction,\nbut would rely on you for the grant writing and reporting requirements. Each\ngrant-making organization usually has terms and reporting requirements that the\nLF and the grant recipients will need to work together on. The \n\nTazama\nproject\nis an example of a recent grant LF Charities is administering from the \n\nBill and\nMelinda Gates\nFoundation.","type":"content","url":"/linux-proposal#how-will-a-transition-to-lf-affect-grant-funding-that-community-members-may-seek","position":37},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups"},"type":"lvl1","url":"/list-of-standing-committees-and-working-groups","position":0},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups"},"content":"Project work that expands beyond software-related work is organized into chartered domains and is carried out by Standing Committees and Working Groups. A description of these bodies and their function can be found \n\nhere. This document contains a list of the current Standing Committees and Working Groups with charter summaries and links to their GitHub repositories.","type":"content","url":"/list-of-standing-committees-and-working-groups","position":1},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl2":"Standing Committees"},"type":"lvl2","url":"/list-of-standing-committees-and-working-groups#list-of-standing-committees","position":2},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl2":"Standing Committees"},"content":"","type":"content","url":"/list-of-standing-committees-and-working-groups#list-of-standing-committees","position":3},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl3":"Diversity, Equity, and Inclusion","lvl2":"Standing Committees"},"type":"lvl3","url":"/list-of-standing-committees-and-working-groups#diversity-equity-and-inclusion","position":4},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl3":"Diversity, Equity, and Inclusion","lvl2":"Standing Committees"},"content":"Charter Summary: Increase diversity, equity, and inclusion within all aspects of Project Jupyter, including the various councils/leadership, Subprojects, and the broader community.","type":"content","url":"/list-of-standing-committees-and-working-groups#diversity-equity-and-inclusion","position":5},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl3":"Code of Conduct Incident Response","lvl2":"Standing Committees"},"type":"lvl3","url":"/list-of-standing-committees-and-working-groups#code-of-conduct-incident-response","position":6},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl3":"Code of Conduct Incident Response","lvl2":"Standing Committees"},"content":"Charter Summary: Own and manage the Jupyter Code of Conduct reporting and incident response processes and make determinations on individual incidents.","type":"content","url":"/list-of-standing-committees-and-working-groups#code-of-conduct-incident-response","position":7},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl3":"Conflict of Interest","lvl2":"Standing Committees"},"type":"lvl3","url":"/list-of-standing-committees-and-working-groups#conflict-of-interest","position":8},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl3":"Conflict of Interest","lvl2":"Standing Committees"},"content":"Charter Summary: Ensure that the joint and conflicting interests of leaders across Project Jupyter are disclosed appropriately, handled with transparency, and mitigated with integrity.","type":"content","url":"/list-of-standing-committees-and-working-groups#conflict-of-interest","position":9},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl3":"Community Advisory Panel","lvl2":"Standing Committees"},"type":"lvl3","url":"/list-of-standing-committees-and-working-groups#community-advisory-panel","position":10},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl3":"Community Advisory Panel","lvl2":"Standing Committees"},"content":"Charter Summary: Advise the Executive Council (EC) with perspectives and connections that may reach beyond the active Jupyter community.","type":"content","url":"/list-of-standing-committees-and-working-groups#community-advisory-panel","position":11},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl2":"Working Groups"},"type":"lvl2","url":"/list-of-standing-committees-and-working-groups#list-of-working-groups","position":12},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl2":"Working Groups"},"content":"","type":"content","url":"/list-of-standing-committees-and-working-groups#list-of-working-groups","position":13},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl3":"Trademark and Branding","lvl2":"Working Groups"},"type":"lvl3","url":"/list-of-standing-committees-and-working-groups#trademark-and-branding","position":14},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl3":"Trademark and Branding","lvl2":"Working Groups"},"content":"Charter Summary: License, protect, and promote the trademarks and visual and textual branding of Jupyter.","type":"content","url":"/list-of-standing-committees-and-working-groups#trademark-and-branding","position":15},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl3":"Jupyter Community Building","lvl2":"Working Groups"},"type":"lvl3","url":"/list-of-standing-committees-and-working-groups#jupyter-community-building","position":16},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl3":"Jupyter Community Building","lvl2":"Working Groups"},"content":"Charter Summary: Grow, build, and connect the global Jupyter community of users and contributors.","type":"content","url":"/list-of-standing-committees-and-working-groups#jupyter-community-building","position":17},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl3":"Jupyter Media Strategy","lvl2":"Working Groups"},"type":"lvl3","url":"/list-of-standing-committees-and-working-groups#jupyter-media-strategy","position":18},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl3":"Jupyter Media Strategy","lvl2":"Working Groups"},"content":"Charter Summary: Ensure that communications in Jupyter official channels are strategic and benefit Project Jupyter.","type":"content","url":"/list-of-standing-committees-and-working-groups#jupyter-media-strategy","position":19},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl3":"Jupyter Documentation","lvl2":"Working Groups"},"type":"lvl3","url":"/list-of-standing-committees-and-working-groups#jupyter-documentation","position":20},{"hierarchy":{"lvl1":"List of Standing Committees and Working Groups","lvl3":"Jupyter Documentation","lvl2":"Working Groups"},"content":"Charter Summary: Serve as a support, helper, and advisory body to assist in improving all aspects of documentation across Jupyter subprojects.","type":"content","url":"/list-of-standing-committees-and-working-groups#jupyter-documentation","position":21},{"hierarchy":{"lvl1":"List of Official Jupyter Subprojects"},"type":"lvl1","url":"/list-of-subprojects","position":0},{"hierarchy":{"lvl1":"List of Official Jupyter Subprojects"},"content":"Jupyter software development is carried out in \n\nSoftware Subprojects. Within the Official Jupyter Subproject designation, there are two types of Subprojects: ones with a formal Subproject Council and SSC representation, and smaller, less active ones whose Subproject Council is the SSC itself. This document enumerates Subprojects of these two types.","type":"content","url":"/list-of-subprojects","position":1},{"hierarchy":{"lvl1":"List of Official Jupyter Subprojects","lvl2":"Official Subprojects with SSC representation"},"type":"lvl2","url":"/list-of-subprojects#official-subprojects-with-ssc-representation","position":2},{"hierarchy":{"lvl1":"List of Official Jupyter Subprojects","lvl2":"Official Subprojects with SSC representation"},"content":"The following Jupyter Subprojects have their own formal Subproject Council that elects and maintains an SSC representative:\n\nJupyter Frontends\n\nJupyterLab\n\nJupyter Notebook\n\nJupyterHub and Binder\n\nJupyterHub\n\nBinder\n\nBinderHub\n\nJupyterHealth\n\nVoilà\n\nJupyter Server\n\nJupyter Server\n\nEnterprise Gateway\n\nKernel Gateway\n\nJupyter Widgets\n\nJupyter Kernels\n\njupyter-xeus\n\nIPykernel\n\nIPython\n\nJupyter Foundations and Standards\n\nJupyter Security\n\nJupyter Accessibility\n\nJupyter Book","type":"content","url":"/list-of-subprojects#official-subprojects-with-ssc-representation","position":3},{"hierarchy":{"lvl1":"List of Official Jupyter Subprojects","lvl2":"Official Subprojects without SSC representation"},"type":"lvl2","url":"/list-of-subprojects#official-subprojects-without-ssc-representation","position":4},{"hierarchy":{"lvl1":"List of Official Jupyter Subprojects","lvl2":"Official Subprojects without SSC representation"},"content":"The following official Jupyter Subprojects are smaller and less active. As such their formal Subproject Council will be the SSC and they will not have an independent SSC delegate. Our expectation is that these smaller teams will basically continue working as they do today, making decisions using the consensus-seeking phase of the Jupyter Decision-Making Guidelines. Even though the SSC has decision-making authority over these projects, the SSC delegates all decisions that do not have broad cross-project implications to the Subproject maintainers. In the rare situation that a vote is called, the SSC will serve as the voting body and will consult closely with the Subproject maintainers. If one of these Subprojects grows or becomes more active, the SSC can, at any time, elect a standalone council for the Subproject, at which point, the Subproject will begin to have an SSC delegate of their own. In all other respects, these Subprojects are full and official Subprojects.\n\nnbdime (\n\nhttps://​github​.com​/jupyter​/nbdime)\n\nnbgrader (\n\nhttps://​github​.com​/jupyter​/nbgrader)\n\nnbviewer (\n\nhttps://​github​.com​/jupyter​/nbviewer)\n\nipyparallel (\n\nhttps://​github​.com​/ipython​/ipyparallel)\n\nAll other repos not listed above and that don’t clearly fall into one of the official Subproject GitHub organizations above.","type":"content","url":"/list-of-subprojects#official-subprojects-without-ssc-representation","position":5},{"hierarchy":{"lvl1":"List of Official Jupyter Subprojects","lvl2":"Notes about Official Jupyter Subprojects"},"type":"lvl2","url":"/list-of-subprojects#notes-about-official-jupyter-subprojects","position":6},{"hierarchy":{"lvl1":"List of Official Jupyter Subprojects","lvl2":"Notes about Official Jupyter Subprojects"},"content":"The Official Jupyter Subprojects document proposes a number of changes to how our repositories are organized into official Subprojects and GitHub organizations. This document describes the changes that are being proposed.\n\nServices\n\nIn general Jupyter services such as Binder, nbviewer, and the Jupyter website involve legal, financial, and operational matters. As such, we are proposing that the actual services are managed by working groups that report to the Executive Council, who can provide the needed support and oversight. For example, if we want to hire full or part time staff to maintain or operate these services, the Executive Council would be responsible for raising funds, hiring, and managing those staff.\n\nThe JupyterHub and Binder teams have a number of unique considerations. Currently all Binder repositories are under the Jupyterhub organizations, but there is a separate (but highly overlapping team) listed as the Binder team. These teams will need to work out if they would like to each have a formal Subproject Council with an SSC representative, or if they would like to have a single team. The Governance Working Group will be available to the JupyterHub and Binder teams to help working through these questions.\n\nWe propose that the Jupyter website and its repository will be governed by a working group that reports to the Executive Council.\n\nWe propose that the nbviewer service (only the actual live service) be governed by a working group that reports to the Executive Council. The reusable part of nbviewer contained (\n\nhttps://​github​.com​/jupyter​/nbviewer) will be an official Jupyter Subproject without SCC representation as described above.\n\nJupyter Kernels\n\nTo consolidate the project’s work on first-party kernels, we propose to establish a new official Subproject called Jupyter Kernels and create a Github organization named jupyter-kernels for the work of the Subproject. All Xeus repositories (\n\nhttps://​github​.com​/jupyter​-xeus) will be moved into this organization. This Subproject will also govern the IPython GitHub organization, which will be left in place (\n\nhttps://​github​.com​/ipython).\n\nA new Subproject Council for this organization will be established, and they will elect an SSC delegate.\n\nJupyter Foundations and Standards\n\nUltimately, because Jupyter standards are cross-project in nature, they are owned by the SSC. The mechanics of day-to-day management of the JEP repo will be decided by the SSC.\n\nThere are a number of repositories that encode project-wide standards and protocols. To consolidate work on these repositories, we propose to establish a new official Subproject called Jupyter Standards and create a Github organization named jupyter-standards for the work of the Subproject. The following repositories will be moved into this organization:\n\nJupyter Client (\n\nhttps://​github​.com​/jupyter​/jupyter​_client)\n\nJupyter Notebook Format (\n\nhttps://​github​.com​/jupyter​/nbformat)\n\nDocumentation for other specifications maintained by other Subprojects, such as the Jupyter Widgets message specification, or the Jupyter Server REST APIs.\n\nJEPs repo (\n\nhttps://​github​.com​/jupyter​/enhancement​-proposals).\n\nJupyter’s software has a number of components that serve as a foundation for many other Subprojects. To consolidate work on these repositories, we propose to establish a new official Subproject called Jupyter Foundations and create a Github organization named jupyter-foundations for the work of the Subproject. The following repositories will be moved into this organization:\n\nnbconvert (\n\nhttps://​github​.com​/jupyter​/nbconvert)\n\nJupyter Core (\n\nhttps://​github​.com​/jupyter​/jupyter​_core)\n\nJupyter-packaging (\n\nhttps://​github​.com​/jupyter​/jupyter​-packaging)\n\nTerminado (\n\nhttps://​github​.com​/jupyter​/terminado)\n\nnbclient (\n\nhttps://​github​.com​/jupyter​/nbclient)\n\nTelemetry (\n\nhttps://​github​.com​/jupyter​/telemetry)\n\nTraitlets (\n\nhttps://​github​.com​/ipython​/traitlets)\n\nJupyter Console (\n\nhttps://​github​.com​/jupyter​/jupyter​_console)\n\nDocker stacks (\n\nhttps://​github​.com​/jupyter​/docker​-stacks)","type":"content","url":"/list-of-subprojects#notes-about-official-jupyter-subprojects","position":7},{"hierarchy":{"lvl1":"New Subproject Process"},"type":"lvl1","url":"/newsubprojects","position":0},{"hierarchy":{"lvl1":"New Subproject Process"},"content":"This document describes the process by which new Subprojects are created in or\nmoved to these organizations from other locations. For a list of current sub-projects in the Jupyter Community, see \n\nthe list of sub-projects.\n\nAttention\n\nThe process for incubation under the \n\njupyter-incubator organization is outdated.\nIt may contain links to archived repositories and wording that refers to an old version of Jupyter’s governance model.\nWe aim to review this language and update them with Jupyter’s new operating structure.\n\nFor guidance in the interim, open an issue on the the Jupyter \n\nSoftware Steering Council team compass with any questions or proposals.\n\nThere are two ways that new Subprojects are created:\n\nDirect Subproject creation\n\ne.g., when contributors to an existing Subproject decide to create a new\nGit repository for related but separable code\n\nIncorporation of an existing external Subproject\n\ne.g., when contributors to a project in\n\n\ngithub​.com​/jupyter​-incubator\nsubmit a proposal for incorporation into one of the official Jupyter\norganizations and receive approval from the Steering Council\n\ne.g., when contributors to a third-party project submit an incorporation\nproposal and receive approval from the Steering Council\n\nNote that projects in \n\ngithub​.com​/jupyter​-incubator\nare not considered officially supported and maintained Subprojects until they\nmeet the criteria below and go through the incorporation process detailed later in\nthis document.","type":"content","url":"/newsubprojects","position":1},{"hierarchy":{"lvl1":"New Subproject Process","lvl2":"Criteria for official Subprojects"},"type":"lvl2","url":"/newsubprojects#criteria-for-official-subprojects","position":2},{"hierarchy":{"lvl1":"New Subproject Process","lvl2":"Criteria for official Subprojects"},"content":"The following criteria will be used in evaluating Subprojects for incorporation\ninto one of the official Jupyter organizations. These apply to any Subproject,\nregardless of who is developing the Subproject. Subprojects should:\n\nHave an active developer community that offers a sustainable model for future development.\n\nHave an active user community.\n\nUse solid software engineering with documentation and tests hosted with appropriate\ntechnologies (\n\nRead The Docs and \n\nTravis\nare examples of technologies that can be used).\n\nDemonstrate continued growth and development.\n\nIntegrate well with other official Subprojects.\n\nBe developed according to the Jupyter governance and contribution model that is documented\n\n\nhere.\n\nHave a well-defined scope.\n\nBe packaged using appropriate technologies such as pip, conda, npm, bower, docker, etc.\n\nAs a general guideline, we support improving existing Subprojects over\nincorporating competing Subprojects in the Project.\n\nThe most important question in evaluating Subprojects for incorporation as\nofficial Subprojects is this: is there broad agreement in the community and\nSteering Council that we are going to develop and maintain the Subproject in an\nofficial capacity?\n\nThe two paths for official Subproject creation are now detailed.","type":"content","url":"/newsubprojects#criteria-for-official-subprojects","position":3},{"hierarchy":{"lvl1":"New Subproject Process","lvl2":"Direct Subproject creation"},"type":"lvl2","url":"/newsubprojects#direct-subproject-creation","position":4},{"hierarchy":{"lvl1":"New Subproject Process","lvl2":"Direct Subproject creation"},"content":"In some cases, Steering Council members can immediately create new official Subprojects in the main\nJupyter organization. This option will be used when the new Subproject is clearly part of the\nexisting scope, activities and development of Project Jupyter.\n\nThe process for direct Subproject creation is minimal and informal: Steering Council members should be in consensus about the\nSubproject’s creation and notify the main Jupyter list of its creation.\n\nThe process is completed when the Executive Council approves a PR that adds the new project to the \n\nlist of sub-projects.","type":"content","url":"/newsubprojects#direct-subproject-creation","position":5},{"hierarchy":{"lvl1":"New Subproject Process","lvl2":"Incorporation of an existing external Subproject"},"type":"lvl2","url":"/newsubprojects#incorporation-of-an-existing-external-subproject","position":6},{"hierarchy":{"lvl1":"New Subproject Process","lvl2":"Incorporation of an existing external Subproject"},"content":"In other cases, Subprojects proposed for incorporation will have existed and been developed as\nopen-source software for some time outside the official Jupyter organizations. This section describes\nthe incorporation process for these existing external Subprojects. This process applies to\nSubprojects that have incubated under the jupyter-incubator GitHub organization (see below),\nSubprojects developed under other GitHub organizations, or Subprojects developed as open-source\nsoftware in other public venues.\n\nWhen a Subproject is incorporated, it becomes an officially supported and maintained part\nof Project Jupyter and is moved to one of the GitHub organizations noted at the top of\nthis document.","type":"content","url":"/newsubprojects#incorporation-of-an-existing-external-subproject","position":7},{"hierarchy":{"lvl1":"New Subproject Process","lvl3":"Proposal for incorporation","lvl2":"Incorporation of an existing external Subproject"},"type":"lvl3","url":"/newsubprojects#proposal-for-incorporation","position":8},{"hierarchy":{"lvl1":"New Subproject Process","lvl3":"Proposal for incorporation","lvl2":"Incorporation of an existing external Subproject"},"content":"If consensus for adoption within a given Jupyter organization’s team is straightforward and the above criteria are met,\na project may be adopted immediately.\nSuch consensus may be established by creating an Issue on the given organization’s team-compass repository.\nIf more discussion is needed,\nthe following more formal proposal process will be used:\n\nThe Subproject team should submit a pull request against the\n\n\njupyter​/enhancement​-proposals repository\nwith an enhancement proposal for including the Subproject in one of the main Jupyter organizations.\nThe enhancement proposal should describe how the Subproject meets each of the above criteria.\n\nThe proposal for incorporation will be discussed by the community using that pull request.\n\nA recommendation will be made by the consensus of the Steering Council (SC).\n\nIf the SC recommends incorporation, the subproject then submits a pull request that adds the new project to the \n\nlist of sub-projects in the \n\njupyter/governance repository.\n\nThe Executive Council must then decide by merging or rejecting the pull request.\n\nTimeline: the SC should make every effort to reach a decision promptly. If\nthere is active discussion and feedback about the proposal, that should be\nallowed to proceed and voices be heard.  But to avoid unnecessary delays waiting for everyone to vote, the following guideline should be used:\n\nupon proposal, allow a week for potential objections (explicit agreement\nwelcome, of course). If no objections, treat silence as agreement.\n\nif a month goes by and there’s continued, active disagreement, that should be\ntreated as a strong signal that the project isn’t ready to graduate (BDFL\npronouncement could still be used to make an acceptance call if judged\nnecessary).\n\nThe possible recommendations of the Steering Council will be:\n\nIntegration into an existing official Suproject.\n\nIncorporation as a new official Subproject.\n\nFurther internal or external incubation (see below) with recommendations on steps the team can\ntake to prepare for future incorporation.\n\nRejection. This option will be used if the Steering Council thinks the proposed Subproject is not\nprogressing or will never be appropriate for incorporation. If a rejected Subproject has been\nincubating under the \n\njupyter-incubator GitHub\norganization, its repository will be removed from that organization after a transition period.","type":"content","url":"/newsubprojects#proposal-for-incorporation","position":9},{"hierarchy":{"lvl1":"New Subproject Process","lvl3":"Incorporation","lvl2":"Incorporation of an existing external Subproject"},"type":"lvl3","url":"/newsubprojects#incorporation","position":10},{"hierarchy":{"lvl1":"New Subproject Process","lvl3":"Incorporation","lvl2":"Incorporation of an existing external Subproject"},"content":"When an existing external Subproject is incorporated as a new official Subproject, the following\nsteps will be taken:\n\nThe repository will be transferred over to one of the main Jupyter GitHub organizations.\n\nA GitHub team will be created for the Subproject, with the Subproject team having\nread/write permissions on the Subproject repository.\n\nThe team will send an email to the main Jupyter list with an announcement about the new\nSubproject.\n\nThe standard \n\nProject Jupyter LICENSE file that\nis maintained in this governance repository will be added to the repository.\n\nCopyright notices in individual files should be updated to the standard form described\nin our \n\nProject Jupyter License.","type":"content","url":"/newsubprojects#incorporation","position":11},{"hierarchy":{"lvl1":"New Subproject Process","lvl2":"Incubation of Subprojects"},"type":"lvl2","url":"/newsubprojects#incubation-of-subprojects","position":12},{"hierarchy":{"lvl1":"New Subproject Process","lvl2":"Incubation of Subprojects"},"content":"Incubation refers to the process of a Subproject initially being developed outside the official\nJupyter organizations. Incubation is recommended for new Subprojects with the following\ncharacteristics:\n\nSignificant unanswered technical questions or uncertainties that require exploration.\n\nEntirely new directions, scopes or ideas that haven’t been vetted with the community.\n\nSignificant, already existing code bases where it is not clear how the Subproject will\nintegrate with the rest of Jupyter.\n\nIncubation also allows the broader community to easily distinguish between stable, officially\nsupported and maintained Subprojects in the main GitHub organizations and new efforts that are\nemerging and being developed for future inclusion.\n\nIf there are questions about whether incubation is appropriate for a given Subproject, interested\nparties should simply start a discussion on the main Jupyter list to get community and Steering\nCouncil feedback.","type":"content","url":"/newsubprojects#incubation-of-subprojects","position":13},{"hierarchy":{"lvl1":"New Subproject Process","lvl3":"Incubation in the jupyter-incubator organization","lvl2":"Incubation of Subprojects"},"type":"lvl3","url":"/newsubprojects#incubation-in-the-jupyter-incubator-organization","position":14},{"hierarchy":{"lvl1":"New Subproject Process","lvl3":"Incubation in the jupyter-incubator organization","lvl2":"Incubation of Subprojects"},"content":"If a Subproject team knows from the start that it would eventually like its Subproject to be part\nof one of the official Jupyter organizations, it can be incubated in the\n\n\njupyter-incubator organization.\n\nThe goals of the incubation in the \n\njupyter-incubator organization are as follows:\n\nContributors can quickly and easily get their code exposed to the Jupyter community while\ncomplying with individual and organizational contribution restrictions.\n\nContributors can work with the community and Steering Council and gather feedback early and often\nthat will help them develop and refine a clear and concise integration proposal.\n\nAllow the community to distinguish between officially supported Subprojects and experimental\nSubprojects pursued by members of the community.","type":"content","url":"/newsubprojects#incubation-in-the-jupyter-incubator-organization","position":15},{"hierarchy":{"lvl1":"New Subproject Process","lvl4":"Repository management policy for incubator projects","lvl3":"Incubation in the jupyter-incubator organization","lvl2":"Incubation of Subprojects"},"type":"lvl4","url":"/newsubprojects#repository-management-policy-for-incubator-projects","position":16},{"hierarchy":{"lvl1":"New Subproject Process","lvl4":"Repository management policy for incubator projects","lvl3":"Incubation in the jupyter-incubator organization","lvl2":"Incubation of Subprojects"},"content":"Projects may from time to time want to create new repositories to explore\nvarious ideas.  The basic policy for this is the following:\n\nIf the project is named foo, it can create new repositories named foo-X\nwithout asking for further authorization.  The project can decide whether to\nannounce the repo on the broader Jupyter channels or not if it thinks there\nis sufficient interest (obviously these repos are still public and open to\nparticipation by all).\n\nIf the project would like to create a repo named bar (a top-level name that\nsomeone else might potentially be interested in), it should post to the main\nJupyter list.  The proposal will be discussed with the assumption that,\nunless someone raises a serious objection, these requests will be approved as\npropmptly as possible.","type":"content","url":"/newsubprojects#repository-management-policy-for-incubator-projects","position":17},{"hierarchy":{"lvl1":"New Subproject Process","lvl3":"Proposal for incubation","lvl2":"Incubation of Subprojects"},"type":"lvl3","url":"/newsubprojects#proposal-for-incubation","position":18},{"hierarchy":{"lvl1":"New Subproject Process","lvl3":"Proposal for incubation","lvl2":"Incubation of Subprojects"},"content":"A Subproject team can initiate the \n\njupyter-incubator\nincubation process by submitting a proposal for incubation. This process is designed to be\nlightweight and quick:\n\nThe proposers must fill out an incubation application by submitting a pull request to the\n\n\njupyter​-incubator​/proposals repository.\n\nProposers must announce their intent to the community with a post to the main Jupyter\nmailing list.\n\nThe proposed Subproject must have an Advocate who is an active Steering Council member. The role\nof the Advocate is to introduce the Subproject team to the Jupyter community and help them through\nincubation processes. While the Advocate may be involved in the actual development and design\nof the Subproject, that is not required.\n\nThe proposal for incubation will be discussed by the community and approved or rejected by\nthe consensus of the Steering Council.\n\nIf approved, the proposal pull request will be merged. If rejected, it will be closed.","type":"content","url":"/newsubprojects#proposal-for-incubation","position":19},{"hierarchy":{"lvl1":"New Subproject Process","lvl3":"Incubation period","lvl2":"Incubation of Subprojects"},"type":"lvl3","url":"/newsubprojects#incubation-period","position":20},{"hierarchy":{"lvl1":"New Subproject Process","lvl3":"Incubation period","lvl2":"Incubation of Subprojects"},"content":"Once a Subproject is approved for incubation in the\n\n\njupyter-incubator organization, the following steps will be\ntaken:\n\nA GitHub repository will be created under the jupyter-incubator organization\n\nA GitHub team will be created with read/write access to the repository, including the\nAdvocate.\n\nThe standard Jupyter \n\nLICENSE file that\nis maintained in this governance repository will be added to the new repository.\n\nA member of the Steering Council will announce the newly incubated Subproject on the\nmain Jupyter list.\n\nThe goal of the incubation period is to demonstrate that the Subproject is going to develop an\nactive developer and user community. There is no particular length of time required for incubation,\nbut it is expected that most Subprojects will be in incubation for at least six months to one year.","type":"content","url":"/newsubprojects#incubation-period","position":21},{"hierarchy":{"lvl1":"New Subproject Process","lvl2":"External incubation"},"type":"lvl2","url":"/newsubprojects#external-incubation","position":22},{"hierarchy":{"lvl1":"New Subproject Process","lvl2":"External incubation"},"content":"Incubation outside the \n\njupyter-incubator organization is also\npossible. In this case, there is no formal process. Any individual or organization can simply create\na new project on their own personal GitHub (or other VCS) repository and develop it as they see fit.\nIf such an externally created and incubated Subproject wants to become part of the official Jupyter\norganizations, the criteria listed at the top of this document must be satisfied and the same\nincorporation process must be followed.\n\nHere’s an example PR from the jupyter-book incorporation process.","type":"content","url":"/newsubprojects#external-incubation","position":23},{"hierarchy":{"lvl1":"Jupyter Governance Overview"},"type":"lvl1","url":"/overview","position":0},{"hierarchy":{"lvl1":"Jupyter Governance Overview"},"content":"Note\n\nJupyter transitioned from a \n\nBenevolent Dictator For Life (BDFL) + Steering Council governance model to this current governance model in December 2022.\n\nThis document provides a brief informational summary of the Project Jupyter governance model. In case of any substantive discrepancy with the official descriptions of each body, the underlying governance documents should be considered as the source of truth, and we will update this overview as needed.\n\nJupyter’s governance model is anchored on three bodies that complement each other:\n\nThe \n\nExecutive Council (EC) is ultimately responsible for all dimensions of the Project (including, but not limited to, software, legal, financial, community, operations, inclusion and diversity, etc.). The members of the EC actively work to carry out the Project’s mission in accordance with its values and to support operations through delegation to the Software Steering Council (SSC), Software Subprojects, Standing Committees, and Working Groups. These other bodies will report to the EC, and the EC is expected to support, oversee, manage, and ensure the success of operations across Jupyter. For more detail, see the \n\nExecutive Council document.\n\nThe \n\nSoftware Steering Council (SSC) has jurisdiction over software-related decisions across Project Jupyter, with a primary focus on coordination across projects and decisions that have impact across many Jupyter Subprojects. It is also a mechanism for representatives of each project to share information and expertise. Technical decisions and processes where the SSC isn’t explicitly involved are automatically delegated to the individual projects to manage their day-to-day activities, create new repositories in their orgs, etc., with independence and autonomy. For more details, see the \n\nSoftware Steering Council document.\n\nThe \n\nJupyter Foundation is a directed fund of the Linux Foundation 501(c)(6) that exists to provide resources and strategic counsel to Project Jupyter. The Executive Council serves on the Jupyter Foundation Governing Board. For more details, see the \n\nJupyter Foundation document.\n\nAdditionally, the Executive Council (EC) receives input from a Community Advisory Panel. This panel advises the EC with perspectives and connections that may reach beyond the active Jupyter community.","type":"content","url":"/overview","position":1},{"hierarchy":{"lvl1":"Jupyter Governance Overview","lvl2":"Other major components of the organization"},"type":"lvl2","url":"/overview#other-major-components-of-the-organization","position":2},{"hierarchy":{"lvl1":"Jupyter Governance Overview","lvl2":"Other major components of the organization"},"content":"In addition to these three bodies, the following are other major parts of the Project related to governance.","type":"content","url":"/overview#other-major-components-of-the-organization","position":3},{"hierarchy":{"lvl1":"Jupyter Governance Overview","lvl3":"Software Subprojects","lvl2":"Other major components of the organization"},"type":"lvl3","url":"/overview#software-subprojects","position":4},{"hierarchy":{"lvl1":"Jupyter Governance Overview","lvl3":"Software Subprojects","lvl2":"Other major components of the organization"},"content":"Software Subprojects in the Jupyter community are official areas of focus and effort within the Jupyter ecosystem. They often map to a single GitHub organization. Subprojects must abide by the \n\nJupyter Code of Conduct, Jupyter decision-making and governance processes (e.g. respecting the project’s trademark policies), as well as commit to certain technical limitations and scope. Each Subproject maintains a Subproject Council and elects one person from the Subproject Council to serve on the Software Steering Council. For more details, see the \n\nSoftware Subprojects document.","type":"content","url":"/overview#software-subprojects","position":5},{"hierarchy":{"lvl1":"Jupyter Governance Overview","lvl3":"Standing Committees and Working Groups","lvl2":"Other major components of the organization"},"type":"lvl3","url":"/overview#standing-committees-and-working-groups","position":6},{"hierarchy":{"lvl1":"Jupyter Governance Overview","lvl3":"Standing Committees and Working Groups","lvl2":"Other major components of the organization"},"content":"In addition to the software work on Jupyter that is coordinated through the Software Steering Council (SSC), much of the project’s work expands beyond software. Examples include code of conduct incident response, diversity and inclusion, operations, legal, fundraising, events, community, and marketing. \n\nStanding Committees and Working Groups carry out this non-software related work of the project by delegation from the Executive Council (EC).\n\nThe primary difference between Standing Committees and Working Groups is that Standing Committees are intended to be permanent; they are only created and dissolved by a joint vote of the EC and SSC. In contrast, Working Groups can be created and dissolved by the EC acting alone.\n\nFor more details, see the \n\nStanding Committees and Working Groups document.","type":"content","url":"/overview#standing-committees-and-working-groups","position":7},{"hierarchy":{"lvl1":"Jupyter Governance Overview","lvl3":"Union of Councils","lvl2":"Other major components of the organization"},"type":"lvl3","url":"/overview#union-of-councils","position":8},{"hierarchy":{"lvl1":"Jupyter Governance Overview","lvl3":"Union of Councils","lvl2":"Other major components of the organization"},"content":"The Union of Councils represents the combination of councils, sub-councils, and working groups in Jupyter.\nSee \n\nthe Union of Councils section for more information.","type":"content","url":"/overview#union-of-councils","position":9},{"hierarchy":{"lvl1":"Jupyter Governance Overview","lvl3":"Distinguished Contributors","lvl2":"Other major components of the organization"},"type":"lvl3","url":"/overview#distinguished-contributors","position":10},{"hierarchy":{"lvl1":"Jupyter Governance Overview","lvl3":"Distinguished Contributors","lvl2":"Other major components of the organization"},"content":"The \n\nDistinguished Contributors are a group of Jupyter community members that have gone above-and-beyond in their support of the project over the years, making substantial and sustained contributions in any area of activity (software development, governance, community engagement, events, etc.). The Jupyter community confers membership in this group as a way of recognizing their effort and saying “thank you.” For more details, see the \n\nDistinguished Contributors document.","type":"content","url":"/overview#distinguished-contributors","position":11},{"hierarchy":{"lvl1":"Jupyter Governance Overview","lvl2":"Decision-making and voting procedures"},"type":"lvl2","url":"/overview#decision-making-and-voting-procedures","position":12},{"hierarchy":{"lvl1":"Jupyter Governance Overview","lvl2":"Decision-making and voting procedures"},"content":"The EC, SSC, Standing Committees and Working Groups all use uniform voting procedures outlined in the \n\nDecision-Making Guide.","type":"content","url":"/overview#decision-making-and-voting-procedures","position":13},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers"},"type":"lvl1","url":"/papers","position":0},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers"},"content":"This document describes the processes used to author Jupyter related academic\npapers, which are typically submitted to peer-reviewed journals. This does not\ninclude talks and posters submitted to conferences unless the conference also\npublishes written proceedings.\n\nOn one hand, the primary focus of Project Jupyter is on producing open-source\nsoftware. We are very much focused on writing code that delights our users. On\nthe other hand, Jupyter (and IPython) emerged out of an acadmic setting, where\nresearch and peer-reviwed publications are a primary focus. To this day, many\nof our core contributors have academic positions and active research programs.\nThis emphasis is also reflected in the usage of Jupyter across all areas of\nscientific research. Thus, in spite of a focus on writing software for users,\nJupyter remains a tool that is by and for researchers.\n\nGiven this focus on research, the ongoing academic careers of many Jupyter\ncontributors, and our desire to have an impact on computing research, it is\nimportant for us to author and publish peer-reviewed papers on Jupyter itself.\nAuthoring these papers in the context of a large, open-source community\npresents a number of differences compared to many research collaborations.","type":"content","url":"/papers","position":1},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl2":"Principles"},"type":"lvl2","url":"/papers#principles","position":2},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl2":"Principles"},"content":"We have tried to create a process for authoring papers with the following\ngeneral principles in mind:\n\nInclusivity and generosity in authorship. Hundreds of individuals have\ncontributed to the different Jupyter subprojects. These contributions span\ncode, design, documentation, discussions, giving talks/tutorials, etc. We\nwant to be generous in extending authorship privileges and responsibilities\nto as many of these contributors as possible.\n\nClear, explicit criteria for authorship. While being generous, we want\nhave concrete, specific and auditable criteria for including individuals as\nauthors.\n\nOpenness. The process of authoring papers should be open in the same way\nas the rest of the project’s work. Thus, all of our papers are written in the\npublic on GitHub.\n\nAccountability. Being an author on a paper is a privilege, but also\ninvolves responsibilities. The concrete processes described below elucidate\nthese responsibilities.\n\nWe expect to author and submit papers to different types of journals. Different\njournals will have slightly different concrete processes that appropriately\nembody these principles.","type":"content","url":"/papers#principles","position":3},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl2":"Author ordering"},"type":"lvl2","url":"/papers#author-ordering","position":4},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl2":"Author ordering"},"content":"In some academic fields, author ordering is used to implicitly communicate the level and significance of the individual’s contributions. We strongly feel this\nis misleading and misguided. Because of this, all Jupyter papers will use the\nfollowing author ordering policy:\n\nThe first author will be listed as “Project Jupyter”;\n\nIndividual authors will follow in alphabetical order; and\n\nAn explicit statement about the ordering will be included in the paper.\n\nListing the first author as “Project Jupyter” is important as it means that in\nabbreviated citations, the author list will be “Project Jupyter, et al.” rather\nthan artificially showing the first alphabetical author’s name. This is common\npractice in academic field such as high energy physics where there are large\nnumbers of authors on papers.","type":"content","url":"/papers#author-ordering","position":5},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl2":"Process for Journal of Open Source Software (JOSS)"},"type":"lvl2","url":"/papers#process-for-journal-of-open-source-software-joss","position":6},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl2":"Process for Journal of Open Source Software (JOSS)"},"content":"The \n\nJournal of Open Source Software (JOSS) is a\npeer-reviewed, developer-friendly journal for research related software. JOSS\nis unique in that:\n\nEach paper is associated with a single GitHub repository;\n\nThe primary research artifact in the software itself; and\n\nThe paper itself is a relatively brief markdown file in the software’s GitHub\nrepository, deferring details of the software to its own documentation.\n\nIt is our intention to publish a JOSS paper for each of our main, user-focused\nsubprojects (Notebook, JupyterLab, JupyterHub, nbconvert, ipywidgets, etc.).\nAll such paper should use the process described herein.","type":"content","url":"/papers#process-for-journal-of-open-source-software-joss","position":7},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl3":"JOSS authorship criteria","lvl2":"Process for Journal of Open Source Software (JOSS)"},"type":"lvl3","url":"/papers#joss-authorship-criteria","position":8},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl3":"JOSS authorship criteria","lvl2":"Process for Journal of Open Source Software (JOSS)"},"content":"Our authorship criteria for JOSS papers are derived from those of the\n\n\nICMJE:\n\nSubstantial contributions to the conception, design, or implementation of\nsoftware; this includes coding, visual design, documentation, testing,\ndiscussions and other such contributions; AND\n\nFinal approval of the version to be published; AND\n\nAgreement to be accountable for all aspects of the work in ensuring that\nquestions related to the accuracy or integrity of any part of the work are\nappropriately investigated and resolved.\n\nAnyone who satisfies and is willing to accept these responsibilities and commitments is welcome to be an author on any of our JOSS publications.","type":"content","url":"/papers#joss-authorship-criteria","position":9},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl3":"JOSS process","lvl2":"Process for Journal of Open Source Software (JOSS)"},"type":"lvl3","url":"/papers#joss-process","position":10},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl3":"JOSS process","lvl2":"Process for Journal of Open Source Software (JOSS)"},"content":"The following process should be used to author any Jupyter related JOSS paper:","type":"content","url":"/papers#joss-process","position":11},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl4":"1. Someone agrees to be the Coordinator for a paper","lvl3":"JOSS process","lvl2":"Process for Journal of Open Source Software (JOSS)"},"type":"lvl4","url":"/papers#id-1-someone-agrees-to-be-the-coordinator-for-a-paper","position":12},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl4":"1. Someone agrees to be the Coordinator for a paper","lvl3":"JOSS process","lvl2":"Process for Journal of Open Source Software (JOSS)"},"content":"A single JOSS paper will be associated with a single Jupyter repository. The\nCoordinator will usually be a senior project contributor, Steering Council\nmember, or leader of that subproject.\n\nThe role of the Coordinator is to implement this process for that paper. They\ndo not have to write the JOSS paper themselves, but they will work with the\ncommunity to organize the writing of the paper.","type":"content","url":"/papers#id-1-someone-agrees-to-be-the-coordinator-for-a-paper","position":13},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl4":"2. Open an issue and announce the writing of the paper","lvl3":"JOSS process","lvl2":"Process for Journal of Open Source Software (JOSS)"},"type":"lvl4","url":"/papers#id-2-open-an-issue-and-announce-the-writing-of-the-paper","position":14},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl4":"2. Open an issue and announce the writing of the paper","lvl3":"JOSS process","lvl2":"Process for Journal of Open Source Software (JOSS)"},"content":"The Coordinator should open an issue to organize the writing of the paper on\nthat repository and then announce to the Jupyter Google Group that the paper is\nbeing worked on and that anyone can contribute (with a link to the issue).","type":"content","url":"/papers#id-2-open-an-issue-and-announce-the-writing-of-the-paper","position":15},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl4":"3. Draft the paper in the repository","lvl3":"JOSS process","lvl2":"Process for Journal of Open Source Software (JOSS)"},"type":"lvl4","url":"/papers#id-3-draft-the-paper-in-the-repository","position":16},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl4":"3. Draft the paper in the repository","lvl3":"JOSS process","lvl2":"Process for Journal of Open Source Software (JOSS)"},"content":"At this point, the Coordinator should organize the writing of the actual paper.\n\nThe \n\nJOSS Author Guidelines detail the format and\nrequirements of a JOSS paper. In general this will involve creating a paper\nsubdirectory in the root of the repository with two files: paper.md and\npaper.bib. The paper should be written using our standard processes for pull\nrequests and code review.","type":"content","url":"/papers#id-3-draft-the-paper-in-the-repository","position":17},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl4":"3. Email potential authors","lvl3":"JOSS process","lvl2":"Process for Journal of Open Source Software (JOSS)"},"type":"lvl4","url":"/papers#id-3-email-potential-authors","position":18},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl4":"3. Email potential authors","lvl3":"JOSS process","lvl2":"Process for Journal of Open Source Software (JOSS)"},"content":"Once a final draft of the paper has been merged into the repository, the\nCoordinator should email all potential authors of the paper, inviting them to\nparticipate. Usually this will include at least two emails:\n\nIndividually email all contributors listed in the Git log of the repository.\nThis list can be generated using the Git command git log --all --format='%cN <%cE>' | sort -u.\n\nEmail the main Jupyter Google Group to include folks not listed in the Git\nlog.\n\nIn addition, the Coordinator should send personal emails to individuals, such\nas students, who are new to writing academic publications, explaining why we\nare writing a paper, and encouraging them to participate. These personal emails\nshould cc the individual’s mentor or advisor if applicable.\n\nBoth of these emails should include:\n\nA verbatim copy of the above JOSS authorship criteria;\n\nA description the tasks each individual needs complete to be an author on the\npaper;\n\nA concrete deadline for completing those tasks (at least 2 weeks out); and\n\nA link to the paper’s markdown file in the repository.\n\nThe tasks each individual needs to complete are as follows:\n\nCreate an account on \n\nORCID.\n\nSubmit a PR to the repository adding their name, ORCID id, and affiliation to\nthe paper;\n\nProvide any edits to the content of the paper;\n\nIn the comment of the PR, briefly describe their contributions to the work;\nand\n\nIn the comment of the PR, provide verification that they have read the paper\nand agree to its publication.\n\nAs the deadline approaches, the Coordinator should remind potential authors to\ncomplete their tasks.","type":"content","url":"/papers#id-3-email-potential-authors","position":19},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl4":"4. Final submission","lvl3":"JOSS process","lvl2":"Process for Journal of Open Source Software (JOSS)"},"type":"lvl4","url":"/papers#id-4-final-submission","position":20},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl4":"4. Final submission","lvl3":"JOSS process","lvl2":"Process for Journal of Open Source Software (JOSS)"},"content":"Once the deadline for authors to complete their tasks has passed, the\nCoordinator should make sure authors are listed in alphabetical order. The\nCoordinator can then submit the paper.","type":"content","url":"/papers#id-4-final-submission","position":21},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl2":"Process for traditional academic papers"},"type":"lvl2","url":"/papers#process-for-traditional-academic-papers","position":22},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl2":"Process for traditional academic papers"},"content":"Papers submitted to other (non-JOSS) journals, will usually be longer and take\na more significant amount of time to author. They will also usually be authored\nin dedicated repository (under the jupyter-resources GitHub organization).\nBecause of these factors, the process is slightly different.","type":"content","url":"/papers#process-for-traditional-academic-papers","position":23},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl3":"Authorship criteria","lvl2":"Process for traditional academic papers"},"type":"lvl3","url":"/papers#authorship-criteria","position":24},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl3":"Authorship criteria","lvl2":"Process for traditional academic papers"},"content":"The authorship criteria for non-JOSS papers is slightly different than for JOSS\nin that all authors are expected to actively participate in the writing and\nediting of the paper.\n\nOur authorship criteria for papers are derived from those of the\n\n\nICMJE:\n\nSubstantial contributions to the conception, design, or implementation of\nsoftware; this includes coding, visual design, documentation, testing,\ndiscussions and other such contributions; AND\n\nDrafting the work or revising it critically for important intellectual\ncontent; AND\n\nFinal approval of the version to be published; AND\n\nAgreement to be accountable for all aspects of the work in ensuring that\nquestions related to the accuracy or integrity of any part of the work are\nappropriately investigated and resolved.\n\nAnyone who satisfies and is willing to accept these responsibilities and\ncommitments is welcome to be an author on any of our publications.\n\nThe second of these responsibilities implies that all authors will actively\nparticipate in the writing of the manuscript. We recognize that not all\nco-authors will contribute equally and in the same way to the writing of a\npaper. Furthermore, for papers with large numbers of co-authors, we expect the\nmain writing will be done by a smaller group of co-authors, with other\nco-authors contributing to editing work and discussions. However, in all cases active participation in some manner is still required.","type":"content","url":"/papers#authorship-criteria","position":25},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl3":"Process","lvl2":"Process for traditional academic papers"},"type":"lvl3","url":"/papers#process","position":26},{"hierarchy":{"lvl1":"Process for Authoring Jupyter Related Academic Papers","lvl3":"Process","lvl2":"Process for traditional academic papers"},"content":"Before creating the detailed process for authoring non-JOSS papers, we want to\ntry out the above process for JOSS papers and see how it should be modified for\nlonger form papers. In general, we expect to closely follow the process used in\nthe SymPy project to author \n\nthis paper.","type":"content","url":"/papers#process","position":27},{"hierarchy":{"lvl1":"Leadership Directory"},"type":"lvl1","url":"/people","position":0},{"hierarchy":{"lvl1":"Leadership Directory"},"content":"This is a directory of the present and past leadership of Project Jupyter.","type":"content","url":"/people","position":1},{"hierarchy":{"lvl1":"Leadership Directory","lvl2":"Executive Council"},"type":"lvl2","url":"/people#executive-council","position":2},{"hierarchy":{"lvl1":"Leadership Directory","lvl2":"Executive Council"},"content":"Alphabetical by first name, names are followed by GitHub usernames and current elected terms.\n\nAfshin Darian, \n\n@afshin, 2023-2026\n\nAna Ruvalcaba, \n\n@Ruv7, 2023-2025\n\nChris Holdgraf, \n\n@choldgraf, 2025-2026\n\nJason Grout, \n\n@jasongrout, 2023-2025\n\nRick Wagner, \n\n@rpwagner, 2025-2026\n\nZach Sailer, \n\n@Zsailer, 2024-2025","type":"content","url":"/people#executive-council","position":3},{"hierarchy":{"lvl1":"Leadership Directory","lvl2":"Software Steering Council"},"type":"lvl2","url":"/people#software-steering-council","position":4},{"hierarchy":{"lvl1":"Leadership Directory","lvl2":"Software Steering Council"},"content":"Subproject\n\nRepresentative\n\nGitHub username\n\nDEI Standing Committee\n\nMartha Cryan\n\n@marthacryan\n\nJupyter Accessibility\n\nGabriel Fouasnon\n\n@gabalafou\n\nJupyter Book\n\nAngus Hollands\n\n@agoose77\n\nJupyter Foundations and Standards\n\nPaul Ivanov\n\n@ivanov\n\nJupyter Frontends\n\nMichał Krassowski\n\n@krassowski\n\nJupyter Kernels\n\nJohan Mabille\n\n@johanmabille\n\nJupyter Security\n\n\n\n\n\nJupyter Server\n\nVidar Fauske\n\n@vidartf\n\nJupyter Widgets\n\nSylvain Corlay\n\n@SylvainCorlay\n\nJupyterHub and Binder\n\nMin Ragan-Kelley\n\n@minrk\n\nVoilà\n\nMartin Renou\n\n@martinRenou","type":"content","url":"/people#software-steering-council","position":5},{"hierarchy":{"lvl1":"Leadership Directory","lvl2":"Jupyter Foundation Governing Board"},"type":"lvl2","url":"/people#jupyter-foundation-governing-board","position":6},{"hierarchy":{"lvl1":"Leadership Directory","lvl2":"Jupyter Foundation Governing Board"},"content":"Representative\n\nOrganization\n\nGitHub username\n\nAfshin Darian\n\nExecutive Council\n\n@afshin\n\nAna Ruvalcaba\n\nExecutive Council\n\n@Ruv7\n\nChris Holdgraf\n\nExecutive Council\n\n@choldgraf\n\nJason Grout\n\nExecutive Council\n\n@jasongrout\n\nRick Wagner\n\nExecutive Council\n\n@rpwagner\n\nZach Sailer\n\nExecutive Council\n\n@Zsailer\n\nBrian Granger\n\nAWS\n\n@ellisonbg\n\nEric Johnson\n\nGoogle\n\n@metrizable\n\nRus Pandey\n\nApple\n\n@bigsur0\n\nStephanie Stattel\n\nBloomberg\n\n\n\nYaniv Schahar\n\nMeta\n\n@YDawn\n\nSavannah Ostrowski\n\nSnowflake\n\n@savannahostrowski\n\nMichał Krassowski\n\nGeneral Members\n\n@krassowski","type":"content","url":"/people#jupyter-foundation-governing-board","position":7},{"hierarchy":{"lvl1":"Leadership Directory","lvl3":"Trademark Subcommittee","lvl2":"Jupyter Foundation Governing Board"},"type":"lvl3","url":"/people#trademark-subcommittee","position":8},{"hierarchy":{"lvl1":"Leadership Directory","lvl3":"Trademark Subcommittee","lvl2":"Jupyter Foundation Governing Board"},"content":"Jason Grout, \n\n@jasongrout\n\nMin Ragan-Kelley, \n\n@minrk\n\nPaul Ivanov, \n\n@ivanov\n\nWilliam Stein, \n\n@williamstein","type":"content","url":"/people#trademark-subcommittee","position":9},{"hierarchy":{"lvl1":"Leadership Directory","lvl3":"DEI Standing Committee","lvl2":"Jupyter Foundation Governing Board"},"type":"lvl3","url":"/people#dei-standing-committee","position":10},{"hierarchy":{"lvl1":"Leadership Directory","lvl3":"DEI Standing Committee","lvl2":"Jupyter Foundation Governing Board"},"content":"Martha Cryan, \n\n@marthacryan\n\nRosio Reyes, \n\n@RRosio","type":"content","url":"/people#dei-standing-committee","position":11},{"hierarchy":{"lvl1":"Leadership Directory","lvl3":"Jupyter Community Building Working Group","lvl2":"Jupyter Foundation Governing Board"},"type":"lvl3","url":"/people#jupyter-community-building-working-group","position":12},{"hierarchy":{"lvl1":"Leadership Directory","lvl3":"Jupyter Community Building Working Group","lvl2":"Jupyter Foundation Governing Board"},"content":"Jason Grout, \n\n@jasongrout\n\nMartha Cryan, \n\n@marthacryan\n\nLahari Chowtoori \n\n@LahariChowtoori\n\nRosio Reyes, \n\n@RRosio\n\nMatt Fisher, \n\n@mfisher87\n\nApril Johnson, \n\n@aprilmj","type":"content","url":"/people#jupyter-community-building-working-group","position":13},{"hierarchy":{"lvl1":"Leadership Directory","lvl3":"Jupyter Media Strategy Working Group","lvl2":"Jupyter Foundation Governing Board"},"type":"lvl3","url":"/people#jupyter-media-strategy-working-group","position":14},{"hierarchy":{"lvl1":"Leadership Directory","lvl3":"Jupyter Media Strategy Working Group","lvl2":"Jupyter Foundation Governing Board"},"content":"Andrii Ieroshenko, \n\n@andrii-i\n\nJacob Diamond-Reivich, \n\n@jake-stack\n\nSylvain Corlay, \n\n@SylvainCorlay","type":"content","url":"/people#jupyter-media-strategy-working-group","position":15},{"hierarchy":{"lvl1":"Leadership Directory","lvl2":"Former Project Jupyter Leadership"},"type":"lvl2","url":"/people#former-project-jupyter-leadership","position":16},{"hierarchy":{"lvl1":"Leadership Directory","lvl2":"Former Project Jupyter Leadership"},"content":"","type":"content","url":"/people#former-project-jupyter-leadership","position":17},{"hierarchy":{"lvl1":"Leadership Directory","lvl3":"Executive Council","lvl2":"Former Project Jupyter Leadership"},"type":"lvl3","url":"/people#executive-council-1","position":18},{"hierarchy":{"lvl1":"Leadership Directory","lvl3":"Executive Council","lvl2":"Former Project Jupyter Leadership"},"content":"Brian Granger, \n\n@ellisonbg, 2023-2024\n\nFernando Pérez, \n\n@fperez, 2023-2024\n\nSteven Silvester, \n\n@blink1073, 2023","type":"content","url":"/people#executive-council-1","position":19},{"hierarchy":{"lvl1":"Leadership Directory","lvl3":"Standing Committees and Working Groups","lvl2":"Former Project Jupyter Leadership"},"type":"lvl3","url":"/people#standing-committees-and-working-groups","position":20},{"hierarchy":{"lvl1":"Leadership Directory","lvl3":"Standing Committees and Working Groups","lvl2":"Former Project Jupyter Leadership"},"content":"Jason Weill, \n\n@JasonWeill, DEI Working Group (2022-2024)\n\nLucy Jimenez, \n\n@LucyJimenez, DEI Working Group (2022-2024)\n\nRollin Thomas, \n\n@rcthomas, Community Building Working Group (2022-2024)\n\nAna Ruvalcaba, \n\n@Ruv7, Jupyter Media Strategy Working Group (2022-2024), Community Building Working Group (2018-2025), DEI Working Group (2022-2025)\n\nSteven Silvester, \n\n@blink1073, Jupyter Media Strategy Working Group (2022-2024)\n\nBrian Granger, \n\n@ellisonbg, Trademark Subcommittee (2017-2025)\n\nTim George, \n\n@tgeorgeux, Trademark Subcommittee (2017-2025)","type":"content","url":"/people#standing-committees-and-working-groups","position":21},{"hierarchy":{"lvl1":"Leadership Directory","lvl3":"Benevolent Dictator for Life (retired December 2022)","lvl2":"Former Project Jupyter Leadership"},"type":"lvl3","url":"/people#benevolent-dictator-for-life-retired-december-2022","position":22},{"hierarchy":{"lvl1":"Leadership Directory","lvl3":"Benevolent Dictator for Life (retired December 2022)","lvl2":"Former Project Jupyter Leadership"},"content":"Prior to December 2022, Jupyter was led by a Benevolent Dictator for Life (BDFL)\nand a Steering Council.\n\nFernando Pérez (\n\n@fperez) was the Benevolent Dictator for Life (BDFL). He\nvoluntarily relinquished his role after Jupyter transitioned to a new governance model in December 2022.","type":"content","url":"/people#benevolent-dictator-for-life-retired-december-2022","position":23},{"hierarchy":{"lvl1":"Leadership Directory","lvl3":"Steering Council (dissolved December 2022)","lvl2":"Former Project Jupyter Leadership"},"type":"lvl3","url":"/people#steering-council-dissolved-december-2022","position":24},{"hierarchy":{"lvl1":"Leadership Directory","lvl3":"Steering Council (dissolved December 2022)","lvl2":"Former Project Jupyter Leadership"},"content":"Afshin Darian, \n\n@afshin (2018-2022)\n\nAna Ruvalcaba, \n\n@Ruv7 (2018-2022)\n\nBrian Granger, \n\n@ellisonbg (Founding member, 2014-2022)\n\nCarol Willing, \n\n@willingc (2017-2022)\n\nDamian Avila, \n\n@damianavila (Founding member, 2014-2022)\n\nFernando Pérez, \n\n@fperez (Founding member, 2014-2022)\n\nJason Grout, \n\n@jasongrout (2015-2022)\n\nJessica Hamrick, \n\n@jhamrick (2015-2022)\n\nJonathan Frederic, \n\n@jdfreder (2016-2018)\n\nKyle Kelley, \n\n@rgbkrk (Founding member, 2014-2022)\n\nM Pacer, \n\n@mpacer (2018-2022)\n\nMatthias Bussonnier, \n\n@carreau (Founding member, 2014-2022)\n\nMin Ragan-Kelley, \n\n@minrk (Founding member, 2014-2022)\n\nPaul Ivanov, \n\n@ivanov (2016-2022)\n\nPeter Parente, \n\n@parente (2016-2022)\n\nSteven Silvester, \n\n@blink1073 (2016-2022)\n\nSylvain Corlay, \n\n@sylvaincorlay (2016-2022)\n\nThomas Kluyver, \n\n@takluyver (Founding member, 2014-2022)","type":"content","url":"/people#steering-council-dissolved-december-2022","position":25},{"hierarchy":{"lvl1":"Leadership Directory","lvl3":"NumFOCUS Subcommittee (dissolved December 2022)","lvl2":"Former Project Jupyter Leadership"},"type":"lvl3","url":"/people#numfocus-subcommittee-dissolved-december-2022","position":26},{"hierarchy":{"lvl1":"Leadership Directory","lvl3":"NumFOCUS Subcommittee (dissolved December 2022)","lvl2":"Former Project Jupyter Leadership"},"content":"Ana Ruvalcaba, \n\n@Ruv7\n\nFernando Pérez, \n\n@fperez\n\nMatthias Bussonnier, \n\n@carreau\n\nStefan van der Walt (non-council member), \n\n@stefanv\n\nThomas Kluyver, \n\n@takluyver","type":"content","url":"/people#numfocus-subcommittee-dissolved-december-2022","position":27},{"hierarchy":{"lvl1":"Licensing terms for Project Jupyter code"},"type":"lvl1","url":"/projectlicense","position":0},{"hierarchy":{"lvl1":"Licensing terms for Project Jupyter code"},"content":"This project is licensed under the terms of the 3-Clause BSD License (also\nknown as New or Revised or Modified BSD License, or the BSD-3-Clause license),\nas follows:\n\nCopyright (c) YEAR Project Jupyter Contributors.\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\nRedistributions of source code must retain the above copyright notice, this\nlist of conditions and the following disclaimer.\n\nRedistributions in binary form must reproduce the above copyright notice,\nthis list of conditions and the following disclaimer in the documentation\nand/or other materials provided with the distribution.\n\nNeither the name of the copyright holder nor the names of its contributors\nmay be used to endorse or promote products derived from this software\nwithout specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS “AS IS”\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.","type":"content","url":"/projectlicense","position":1},{"hierarchy":{"lvl1":"Licensing terms for Project Jupyter code","lvl2":"Explanation of Project Jupyter copyright policy"},"type":"lvl2","url":"/projectlicense#explanation-of-project-jupyter-copyright-policy","position":2},{"hierarchy":{"lvl1":"Licensing terms for Project Jupyter code","lvl2":"Explanation of Project Jupyter copyright policy"},"content":"Project Jupyter uses a shared copyright model. Each contributor maintains\ncopyright over their contributions to Project Jupyter. These contributions are\ntypically only changes to the repositories. Thus, Project Jupyter source code,\nin its entirety, is not the copyright of any single person or institution.\nInstead, Project Jupyter source code is the collective copyright of its\ncontributors. If individual contributors want to maintain a record of what\nchanges or contributions they have specific copyright on, they should indicate\ntheir copyright in the commit message of the change when they commit the\nchange to one of the Project Jupyter repositories.\n\nWith this in mind, the following banner should be used in any source code file\nto indicate the copyright and license terms:# Copyright (c) Project Jupyter Contributors.\n# Distributed under the terms of the 3-Clause BSD License.","type":"content","url":"/projectlicense#explanation-of-project-jupyter-copyright-policy","position":3},{"hierarchy":{"lvl1":"Software Steering Council"},"type":"lvl1","url":"/software-steering-council","position":0},{"hierarchy":{"lvl1":"Software Steering Council"},"content":"The current members of the Software Steering Council are listed in the \n\nLeadership Directory.","type":"content","url":"/software-steering-council","position":1},{"hierarchy":{"lvl1":"Software Steering Council","lvl2":"Purpose"},"type":"lvl2","url":"/software-steering-council#purpose","position":2},{"hierarchy":{"lvl1":"Software Steering Council","lvl2":"Purpose"},"content":"The Jupyter Software Steering Council (SSC) has jurisdiction over software-related decisions across Project Jupyter, with a primary focus on coordination across projects and decisions that have impact across many Jupyter Subprojects. It is also a mechanism for representatives of each project to share information and expertise. Technical decisions and processes where the SSC isn’t explicitly involved are automatically delegated to the individual projects to manage their day-to-day activities, create new repositories in their orgs, etc., with independence and autonomy.","type":"content","url":"/software-steering-council#purpose","position":3},{"hierarchy":{"lvl1":"Software Steering Council","lvl2":"Responsibilities"},"type":"lvl2","url":"/software-steering-council#responsibilities","position":4},{"hierarchy":{"lvl1":"Software Steering Council","lvl2":"Responsibilities"},"content":"","type":"content","url":"/software-steering-council#responsibilities","position":5},{"hierarchy":{"lvl1":"Software Steering Council","lvl3":"Sole responsibilities","lvl2":"Responsibilities"},"type":"lvl3","url":"/software-steering-council#sole-responsibilities","position":6},{"hierarchy":{"lvl1":"Software Steering Council","lvl3":"Sole responsibilities","lvl2":"Responsibilities"},"content":"The SSC is responsible for the following:\n\nDefining the submission, review, and approval process for Jupyter Enhancement Proposals.\n\nStewarding the JEP process to ensure that it is inclusive and participatory, and solicits feedback from the right stakeholders. As a starting point, \n\nthe NumFOCUS DISCOVER Cookbook may offer some useful starting pointers.\n\nMaking decisions on JEPs after receiving community feedback (JEPs are the mechanism for elevating any software decision/idea up to the broader Project, while individual Subprojects can make decisions within their scope via their regular mechanisms).\n\nOwning, managing and implementing the Jupyter Incubation process (\n\nhttps://​github​.com​/jupyter​-incubator).\n\nOwning, managing and implementing the Jupyter Attic process (\n\nhttps://​github​.com​/orgs​/jupyter​/repositories​?type​=​source​&​q​=​archived​%3Atrue).\n\nStewarding discussions and activities beyond JEPs that involve cross-cutting concerns, standards, protocols and other architectural issues that impact the entire project.\n\nOwning and managing anything related to security vulnerabilities across the project, including the Jupyter security lists, any private security repositories, etc.\n\nVoting to accept Working Groups nominated by the Executive Council (EC) to have a representative on the SSC.","type":"content","url":"/software-steering-council#sole-responsibilities","position":7},{"hierarchy":{"lvl1":"Software Steering Council","lvl3":"Shared responsibilities with the Executive Council","lvl2":"Responsibilities"},"type":"lvl3","url":"/software-steering-council#shared-responsibilities-with-the-executive-council","position":8},{"hierarchy":{"lvl1":"Software Steering Council","lvl3":"Shared responsibilities with the Executive Council","lvl2":"Responsibilities"},"content":"The EC and SSC share responsibility for approving:\n\nChanges to the Jupyter Governance model.\n\nCreation of new Jupyter Subprojects.\n\nRemoval of Subprojects from Jupyter.\n\nIn these decisions, each body will \n\nvote independently and the change will be approved only if both bodies approve.","type":"content","url":"/software-steering-council#shared-responsibilities-with-the-executive-council","position":9},{"hierarchy":{"lvl1":"Software Steering Council","lvl2":"Membership"},"type":"lvl2","url":"/software-steering-council#membership","position":10},{"hierarchy":{"lvl1":"Software Steering Council","lvl2":"Membership"},"content":"SSC members are representatives from Jupyter Subprojects that wish to assist the community in sharing information across projects and participate in decision-making that affects many stakeholders in the Jupyter ecosystem. Any Subproject council member is eligible to represent the Subproject on the SSC. While not ideal, one person may serve as the SSC representative for more than one Subproject. In this case, a representative may cast one vote for each Subproject they represent in SSC decisions.\n\nA person may not serve simultaneously on the SSC and the EC.\n\nThe SSC may vote to remove an SSC member. A removal motion passes if two-thirds of the entire SSC votes in favor of removal. All SSC members are expected to vote without recusal, including the member in question.","type":"content","url":"/software-steering-council#membership","position":11},{"hierarchy":{"lvl1":"Software Steering Council","lvl3":"Member composition","lvl2":"Membership"},"type":"lvl3","url":"/software-steering-council#member-composition","position":12},{"hierarchy":{"lvl1":"Software Steering Council","lvl3":"Member composition","lvl2":"Membership"},"content":"The Software Steering Council is composed of one representative from each of the Jupyter Subprojects. In addition, the SSC will contain members from certain Working Groups and Standing Committees whose scope has important impact on SSC activities, such as Diversity and Inclusion, and Internationalization.","type":"content","url":"/software-steering-council#member-composition","position":13},{"hierarchy":{"lvl1":"Software Steering Council","lvl3":"Term length","lvl2":"Membership"},"type":"lvl3","url":"/software-steering-council#term-length","position":14},{"hierarchy":{"lvl1":"Software Steering Council","lvl3":"Term length","lvl2":"Membership"},"content":"There is no term length for SSC membership, as each Jupyter Subproject is in charge of selecting its own representative. Projects are encouraged to define their own expectations around SSC membership tenure, to share SSC membership responsibilities among core team members, and to provide mechanisms for healthy rotation that avoid burnout.","type":"content","url":"/software-steering-council#term-length","position":15},{"hierarchy":{"lvl1":"Software Steering Council","lvl3":"Selecting SSC members","lvl2":"Membership"},"type":"lvl3","url":"/software-steering-council#selecting-ssc-members","position":16},{"hierarchy":{"lvl1":"Software Steering Council","lvl3":"Selecting SSC members","lvl2":"Membership"},"content":"Each Jupyter Subproject, Working Group, or Standing Committee with SSC representation is responsible to nominate a single representative using the \n\nJupyter Decision-Making Guidelines.","type":"content","url":"/software-steering-council#selecting-ssc-members","position":17},{"hierarchy":{"lvl1":"Software Steering Council","lvl3":"Bootstrapping the SSC","lvl2":"Membership"},"type":"lvl3","url":"/software-steering-council#bootstrapping-the-ssc","position":18},{"hierarchy":{"lvl1":"Software Steering Council","lvl3":"Bootstrapping the SSC","lvl2":"Membership"},"content":"The initial Software Steering Council will be created with individuals nominated by each of the major Jupyter Subprojects, as defined by our \n\nofficial list.","type":"content","url":"/software-steering-council#bootstrapping-the-ssc","position":19},{"hierarchy":{"lvl1":"Software Steering Council","lvl2":"Communication"},"type":"lvl2","url":"/software-steering-council#communication","position":20},{"hierarchy":{"lvl1":"Software Steering Council","lvl2":"Communication"},"content":"","type":"content","url":"/software-steering-council#communication","position":21},{"hierarchy":{"lvl1":"Software Steering Council","lvl3":"Meetings","lvl2":"Communication"},"type":"lvl3","url":"/software-steering-council#meetings","position":22},{"hierarchy":{"lvl1":"Software Steering Council","lvl3":"Meetings","lvl2":"Communication"},"content":"Times for SSC meetings is defined \n\non the Jupyter Community Calendar.","type":"content","url":"/software-steering-council#meetings","position":23},{"hierarchy":{"lvl1":"Software Steering Council","lvl3":"E-mail list","lvl2":"Communication"},"type":"lvl3","url":"/software-steering-council#e-mail-list","position":24},{"hierarchy":{"lvl1":"Software Steering Council","lvl3":"E-mail list","lvl2":"Communication"},"content":"You can e-mail the Software Steering Council \n\nat this Google Groups address.","type":"content","url":"/software-steering-council#e-mail-list","position":25},{"hierarchy":{"lvl1":"Software Subprojects"},"type":"lvl1","url":"/software-subprojects","position":0},{"hierarchy":{"lvl1":"Software Subprojects"},"content":"Software design and development in Project Jupyter is organized into a set of Software Subprojects. The lifecycle of Software Subprojects is described in detail \n\nhere. A list of Subprojects is \n\nhere.","type":"content","url":"/software-subprojects","position":1},{"hierarchy":{"lvl1":"Software Subprojects","lvl2":"Responsibilities of Jupyter Subprojects"},"type":"lvl2","url":"/software-subprojects#responsibilities-of-jupyter-subprojects","position":2},{"hierarchy":{"lvl1":"Software Subprojects","lvl2":"Responsibilities of Jupyter Subprojects"},"content":"Unless the \n\nSoftware Steering Council (SSC) or the \n\nExecutive Council (EC) says otherwise, Subprojects self-govern as autonomously as possible, while following the overall governance model and processes of Project Jupyter. Specifically, all Subprojects under Jupyter’s governance have the following responsibilities:\n\nAdhere to the \n\nJupyter Code of Conduct.\n\nAdhere to the \n\nJupyter Decision-Making Guidelines and process.\n\nWhere applicable, nominate and maintain a single representative to the SSC.\n\nFollow the Jupyter \n\nlicensing guidelines and practices.\n\nFollow the Jupyter \n\ntrademark, branding, and intellectual property guidelines.\n\nConduct its activities in a manner that is open, transparent, and inclusive. This includes coordinating with the SSC and EC on mechanisms for information flow and updates to the broader community.\n\nMaintain Subproject source code on GitHub in the \n\nProject Jupyter GitHub enterprise organization.\n\nEnsure that Python packages published on PyPI are under the \n\nJupyter PyPI\norganisation.\n\nMaintain a publicly visible Team Compass with a list of the Subproject Council members.","type":"content","url":"/software-subprojects#responsibilities-of-jupyter-subprojects","position":3},{"hierarchy":{"lvl1":"Software Subprojects","lvl2":"Incubator Subprojects"},"type":"lvl2","url":"/software-subprojects#incubator-subprojects","position":4},{"hierarchy":{"lvl1":"Software Subprojects","lvl2":"Incubator Subprojects"},"content":"Incubator Subprojects are experimental and early-stage efforts where ideas are being explored and developed in the open and under the principles of Jupyter’s governance.  Therefore, Subprojects under incubation have the same responsibilities listed above for official Jupyter projects.\n\nThe \n\nJupyter Incubator GitHub organization serves as a home for all Incubator Subprojects and has further details on the process to create and approve them. This organization serves as a neutral playing ground for people who can’t easily create their own repositories.","type":"content","url":"/software-subprojects#incubator-subprojects","position":5},{"hierarchy":{"lvl1":"Software Subprojects","lvl2":"SSC Representation"},"type":"lvl2","url":"/software-subprojects#ssc-representation","position":6},{"hierarchy":{"lvl1":"Software Subprojects","lvl2":"SSC Representation"},"content":"Official Jupyter Software Subprojects that have large and active enough teams to have a standalone, formal Subproject Council will elect and maintain a single representative to the SSC. The Subproject Council of each such Subproject is free to set term limits or rotate this responsibility as they see fit.\n\nThere exist two categories of Subprojects that, while operating under Jupyter’s governance, do not have a dedicated delegate to the SSC:\n\nThere are a number of smaller and/or low-activity Subprojects that don’t have enough active participants to have a standalone Subproject Council. The SSC itself will be the formal Subproject Council for these Subprojects when necessary, while otherwise allowing the team to manage its day-to-day activities.\n\nProjects in the Jupyter Incubator will only acquire official SSC representation if/once they graduate to official Jupyter Subproject status.","type":"content","url":"/software-subprojects#ssc-representation","position":7},{"hierarchy":{"lvl1":"Standing Committees and Working Groups"},"type":"lvl1","url":"/standing-committees-and-working-groups","position":0},{"hierarchy":{"lvl1":"Standing Committees and Working Groups"},"content":"","type":"content","url":"/standing-committees-and-working-groups","position":1},{"hierarchy":{"lvl1":"Standing Committees and Working Groups","lvl2":"Overview"},"type":"lvl2","url":"/standing-committees-and-working-groups#overview","position":2},{"hierarchy":{"lvl1":"Standing Committees and Working Groups","lvl2":"Overview"},"content":"In addition to the software work on Jupyter that is coordinated through the \n\nSoftware Steering Council (SSC), much of the project’s work expands beyond software. Examples include code of conduct incident response, diversity and inclusion, operations, legal, fundraising, events, community, and marketing. Standing Committees and Working Groups carry out this non-software related work of the project by delegation from the \n\nExecutive Council.\n\nThe primary difference between Standing Committees and Working Groups is that Standing Committees are intended to be permanent; they are only created and dissolved by a joint vote of the EC and SSC. In contrast, Working Groups can be created and dissolved by the EC acting alone.\n\nA list of Standing Committees and Working Groups can be \n\nfound here.","type":"content","url":"/standing-committees-and-working-groups#overview","position":3},{"hierarchy":{"lvl1":"Standing Committees and Working Groups","lvl2":"Common Points"},"type":"lvl2","url":"/standing-committees-and-working-groups#common-points","position":4},{"hierarchy":{"lvl1":"Standing Committees and Working Groups","lvl2":"Common Points"},"content":"Standing Committees and Working Groups both:\n\nHave a well-defined council which makes decisions using the \n\nJupyter Decision-Making Guide.\n\nFollow the council appointment process outlined in their charter.\n\nAre managed by, report to, and are accountable to the \n\nExecutive Council.\n\nHave charters that define their scope and purpose. Within those charters, they are free to make decisions autonomously.\n\nCarry out their functions in a manner that is as open and transparent as possible given the unique dimensions of their charter.\n\nMaintain a public GitHub repository with basic information (council members, charter, public meetings, SSC representative, etc.) for purposes of transparency and consistency.","type":"content","url":"/standing-committees-and-working-groups#common-points","position":5},{"hierarchy":{"lvl1":"Standing Committees and Working Groups","lvl2":"Standing Committees"},"type":"lvl2","url":"/standing-committees-and-working-groups#standing-committees","position":6},{"hierarchy":{"lvl1":"Standing Committees and Working Groups","lvl2":"Standing Committees"},"content":"Standing Committees have the following unique properties:\n\nStanding Committees focus on areas critical to the governance of the project and thus are established and dissolved by joint decisions of the SSC and EC.\n\nChanges to the charters of Standing Committees are approved by joint decisions of the SSC and EC.\n\nStanding Committees always have a representative on the SSC, elected by the Standing Committee Council.\n\nThe EC is responsible for ensuring the Standing Committees are appropriately resourced at all times.","type":"content","url":"/standing-committees-and-working-groups#standing-committees","position":7},{"hierarchy":{"lvl1":"Standing Committees and Working Groups","lvl2":"Working Groups"},"type":"lvl2","url":"/standing-committees-and-working-groups#working-groups","position":8},{"hierarchy":{"lvl1":"Standing Committees and Working Groups","lvl2":"Working Groups"},"content":"Working Groups have the following unique properties:\n\nWorking Groups are established and dissolved by decisions of EC.\n\nChanges to the charters of Working Groups are approved by the EC.\n\nWorking Groups, by default, do not have representatives on the SSC.\n\nOptionally, the EC may nominate certain Working Groups to have a representative on the SSC. Once approved by the SSC to have a representative on the SSC, Working Group councils elect and maintain their representative to the SSC using the Decision-Making Guide.","type":"content","url":"/standing-committees-and-working-groups#working-groups","position":9},{"hierarchy":{"lvl1":"Trademark Usage Policy"},"type":"lvl1","url":"/trademarks","position":0},{"hierarchy":{"lvl1":"Trademark Usage Policy"},"content":"This document’s goal is to clarify allowed uses of the Jupyter trademarks.\nWe wish to implement a very permissive policy that legally protects the trademarks\nwhile encouraging the community to liberally use the trademarks.\nIn general:\n\nIf you are using the Jupyter name or a Jupyter logo to refer to Jupyter, that is generally allowed, and you don’t need to ask permission.\n\nIf you are using a Jupyter logo, please use an unmodified version from the \n\nbrand guidelines.\n\nSee the \n\nUses that Never Require Approval\nsection for the details in most common cases,\nand feel free to get in touch with the \n\nJupyter Trademarks Committee if you have any further questions.\n\nThis document is based on the \n\nPython Software Foundation trademark policy,\nso if you are familiar with use of Python and its logo and trademarks,\nthese guidelines are quite similar.","type":"content","url":"/trademarks","position":1},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl2":"Introduction"},"type":"lvl2","url":"/trademarks#introduction","position":2},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl2":"Introduction"},"content":"This document outlines the policy of the Project Jupyter (“Jupyter”)\nregarding the use of its trademarks.\nAny use of any Project Jupyter trademark must be in accordance with this policy.\n\n“Jupyter” is a trademark of LF Charities, of which Project Jupyter is a part.\n\nThe Jupyter logos (in several variants) are trademarks of LF Charities as well.\n\nThe Jupyter Trademark is registered with the U.S. Patent & Trademark Office.\n\nDerivative word marks referring to Jupyter projects or events,\nsuch as “JupyterDays,” “JupyterLab,” “JupyterHub,”\n“Jupyter Notebook” are also covered by this policy.\n\nAll trademarks, even those that apply to open source software,\nmust be used according to certain legal requirements.\nIf these requirements are not met, the trademark may be endangered or lost.\nOne of these requirements is for the trademark owner (in this case, LF Charities)\nto maintain standards for using its trademarks,\nand to enforce acceptable use of the trademarks by taking action against parties that violate those standards.\n\nTrademark law is mainly a way to protect the public,\nrather than the trademark holder.\nThis means that uses of trademarks that confuse consumers are not permitted under law.\nIn our case, “consumers” would include our developer and user community,\nor anyone else who might be likely to use Jupyter services, software, or applications.\nAs the owner of the trademark, we must be sure the mark is used properly,\nso the community is not confused.\nThat is what we mean when we say that an unpoliced trademark may be endangered or lost.\nWhen the trademark no longer represents a certain level of quality to the community,\nor no longer indicates that we are the source of the products that bear the trademark,\nthe trademark loses its value.\n\nUnderlying Project Jupyter’s trademark policy is a set of guidelines for what is\n-- and is not -- acceptable use of our trademarks,\nspecifically the word mark “Jupyter”, the Jupyter logos,\nand variations of those marks.\nThis policy describes the uses generally approved by Jupyter and LF Charities for its trademarks.\nHowever, if you violate this policy,\nor otherwise take actions that may compromise the reputation or trademarks of Jupyter,\nor expose LF Charities to liability,\nLF Charities may require you to cease all use of any Jupyter trademark,\nregardless of the uses allowed in this policy.","type":"content","url":"/trademarks#introduction","position":3},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl2":"General Goals"},"type":"lvl2","url":"/trademarks#general-goals","position":4},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl2":"General Goals"},"content":"In general, we want the word mark “Jupyter” and the Jupyter logos to be used with minimal restriction to refer to Jupyter events, software, or services.\n\nWe do not want these trademarks to be used:\n\nto refer to any other events, software, or services\n\nin a way that is misleading or may imply association of third-party events,\nsoftware, or services with Project Jupyter\n\nin ways that confuse the community as to whether the software created by Project Jupyter is open source and free to use","type":"content","url":"/trademarks#general-goals","position":5},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl2":"Uses that Never Require Approval"},"type":"lvl2","url":"/trademarks#uses-that-never-require-approval","position":6},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl2":"Uses that Never Require Approval"},"content":"All trademarks are subject to “nominative use rules” that allow use of the trademark\nto name the trademarked entity in a way that is minimal\nand does not imply a sponsorship relationship with the trademark holder.\n\nAs such, stating accurately that software, a service, or an activity uses Jupyter software,\nintegrates with Jupyter software, that it is compatible with Jupyter software,\nor that it contains Jupyter software, is always allowed.\nIn those cases, you may use the word “Jupyter”, unaltered Jupyter logos, or images or videos\nof Jupyter applications to indicate this, without our prior approval, provided such use does\nnot imply Project Jupyter’s sponsorship or endorsement.\nThis is true both for non-commercial and commercial uses.\n\nThis clause overrides other clauses of this policy.\nHowever, if you have any doubts about your intended use of the trademarks,\nplease contact the \n\nJupyter Trademarks Committee.","type":"content","url":"/trademarks#uses-that-never-require-approval","position":7},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl3":"Use of the Jupyter trademark on merchandise","lvl2":"Uses that Never Require Approval"},"type":"lvl3","url":"/trademarks#use-of-the-jupyter-trademark-on-merchandise","position":8},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl3":"Use of the Jupyter trademark on merchandise","lvl2":"Uses that Never Require Approval"},"content":"Using the Jupyter trademarks to refer to Jupyter on your own product’s merchandise is covered by the \n\nUses that Never Require Approval above.\n\nWe encourage use of the Jupyter trademarks (logo and word mark) on stickers, hats, mugs, t-shirts,\nand other physical merchandise to promote the project and the broader open-source ecosystem.\nNo explicit approval is needed for these uses as long as\n\nthe use follows the official Jupyter Brand Guidelines and\n\nthe merchandise is provided free of charge.\n\nWe understand that not everyone (including ourselves) can afford to give away merchandise\nin sufficient quantities to meet demand.\nBecause of this, we would love help from the community in creating an official place to purchase\nJupyter branded merchandise with the profits going back to the project through LF Charities.\n\nIf you are interested in helping out with this please get in touch with us on\nthe \n\nJupyter Google Group.\nOffering Jupyter branded merchandise for sale without explicit approval is not permitted.","type":"content","url":"/trademarks#use-of-the-jupyter-trademark-on-merchandise","position":9},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl2":"Uses that Always Require Approval"},"type":"lvl2","url":"/trademarks#uses-that-always-require-approval","position":10},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl2":"Uses that Always Require Approval"},"content":"Any commercial use of the Jupyter trademarks in product or company names must be approved first by  Project Jupyter.\nSome uses, like calling a company “The Jupyter Company,” or a product “Jupyter Hosting” or “Jupyter Cloud” will be refused.\nThis is because they are overly broad,\nor confusing as to whether Jupyter is open source or commercial,\nor whether your product or organization is affiliated with or sponsored by Project Jupyter.\n\nAny use of a derived (modified) logo for any commercial or non-commercial purpose must also be approved first by Project Jupyter.\nWe will generally be unable to do this because of the confusion it may cause.","type":"content","url":"/trademarks#uses-that-always-require-approval","position":11},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl2":"How to Use the Trademarks"},"type":"lvl2","url":"/trademarks#how-to-use-the-trademarks","position":12},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl2":"How to Use the Trademarks"},"content":"Although many uses of Jupyter’s trademarks are governed by more specific rules,\nwhich appear in the examples below,\nthe following basic guidelines apply to almost any use of Jupyter’s trademarks.\n\nThe Jupyter trademarks are registered.\nThese marks should be used in accordance with the Jupyter \n\nbrand guidelines,\nand should be accompanied by a symbol for registered trademarks: “(r)” or “®”.\nThis may not be removed or obscured and must always be included with the logo.\nThis requirement is waived in all contexts where such marks are not normally included:\nemail, online discussion, non-graphical advertisements (when permitted), and academic papers.\nWe encourage the use of the symbol whenever possible,\nbut recognize that many non-commercial and informal uses will omit it.\n\nIf the word “Jupyter” or the Jupyter logos are used in certain contexts,\nthe following statement should accompany its use:\n\n“Jupyter” and the Jupyter logos are trademarks or registered trademarks of LF Charities,\nused by ___________ with permission.\n\nFor websites and documentation this can be on a “legal statements” page.\nFor brochures and published articles, this statement is optional.\nWe encourage use of this statement, particularly for published materials,\nbut recognize some non-commercial and informal uses will omit it.\n\nDon’t use the trademark as a verb (“Jupyter your software today!”).","type":"content","url":"/trademarks#how-to-use-the-trademarks","position":13},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl2":"Examples"},"type":"lvl2","url":"/trademarks#examples","position":14},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl2":"Examples"},"content":"We have specific rules for the following uses:\n\nUse of the word “Jupyter” in text, or as text in 3rd party logos and trademarks.\n\nUse of one of the Jupyter-provided logo variants in unaltered form.\n\nThe following rules apply to the use of trademarks in each of these classes.","type":"content","url":"/trademarks#examples","position":15},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl3":"The word “Jupyter”","lvl2":"Examples"},"type":"lvl3","url":"/trademarks#the-word-jupyter","position":16},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl3":"The word “Jupyter”","lvl2":"Examples"},"content":"Use of the word “Jupyter” in the names of freely distributed products like neo4jupyter,\njupyter-spark, jupyter-fortran-kernel --\nAllowed when referring to use with or suitability for Jupyter.\nFor commercial products, contact the Jupyter Trademark Committee for permission.\n\nUse of the word “Jupyter” in company names --\nAllowed only by prior written permission from the Jupyter Trademark Committee.\n\nUse of the word “Jupyter” when redistributing Jupyter software as part of\na freely distributed application -- Allowed.\nIf the standard version of the Jupyter software is modified,\nthis should be clearly indicated. For commercial distributions,\ncontact Jupyter for permission if your use is not covered by the nominative use rules\ndescribed in the section “Uses that Never Require Approval” above.\n\nUse of the word “Jupyter” in the names of user groups and conferences that are free to join or attend (Ex., “Jupyter Meetup”) --\nAllowed if referring to the Jupyter software. Other uses require permission.\n\nUse of the word “Jupyter” in the name of books or publications like “Jupyter Journal” and “Jupyter Cookbook” --\nAllowed if referring to the Jupyter software.\n\nUse of the word “Jupyter” on websites, brochures, documentation, and product packaging --\nAllowed if referring to the Jupyter software.\nPlease follow the rules above about the use of the TM symbol.\n\nUse of the word “Jupyter” in advertisements --\nAllowed in most cases by the nominative use rules described in the section\n“Uses that Never Require Approval” above.\nOther uses in ads only with prior permission.\n\nUse of the word “Jupyter” in email and informally -- Allowed without the TM symbol.\n\nUse of the word “Jupyter” in academic papers, theses, and books --\nAllowed without the TM symbol. Books should include the symbol.\n\nUse of the word “Jupyter” in another trademark --\nNot allowed without prior written permission from Jupyter, except as described above.\n\nUse of the word “Jupyter” in a domain name --\nAllowed in subdomains and url paths,\nsuch as “jupyter.example.com” and “example.com/jupyter”.\nAllowed in base domains where the organization responsible for the service is clear in the name itself, e.g. “myorganization-jupyter.org” or “uoffoojupyterusers.edu”.\nNot allowed in base domains on its own or with only generic terms, such as “jupytercloud.com” or “hostedjupyter.horse”.","type":"content","url":"/trademarks#the-word-jupyter","position":17},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl3":"Unaltered Logos","lvl2":"Examples"},"type":"lvl3","url":"/trademarks#unaltered-logos","position":18},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl3":"Unaltered Logos","lvl2":"Examples"},"content":"Use of unaltered Jupyter-provided logos on T-shirts, mugs, etc. --\nAgain, non-commercial uses to promote the Jupyter software are allowed.\nCommercial uses (which includes any use where you sell these items for money)\nrequire permission from Project Jupyter.\nPlease reproduce our logos with the right colors and fonts; if you need help, let us know.\nSee the \n\nbrand guidelines.\n\nUse of unaltered Jupyter-provided logos on websites, brochures, and product packaging.\nNon-commercial uses to promote the Jupyter software are allowed,\nas are all nominative uses as described in the section “Uses that Never Require Approval”.\nAny other commercial uses require prior written permission from Project Jupyter.\nSee the \n\nbrand guidelines.","type":"content","url":"/trademarks#unaltered-logos","position":19},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl2":"Acknowledgments"},"type":"lvl2","url":"/trademarks#acknowledgments","position":20},{"hierarchy":{"lvl1":"Trademark Usage Policy","lvl2":"Acknowledgments"},"content":"This document is derived from the \n\nPython Software Foundation trademark policy.","type":"content","url":"/trademarks#acknowledgments","position":21}]}